xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
#include "app_ui.h"
#include "audio_player.h"
#include "esp32_s3_szp.h"
#include "random_image_app.h"
#include "file_iterator.h"
#include "string.h"
#include <dirent.h>
#include "bt/ble_hidd_demo.h"
#include "esp_wifi.h"
#include "freertos/event_groups.h"
#include "esp_event.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "nvs.h"
#include "img_converters.h"
#include "jpeg_decoder.h"
#include "extra/libs/gif/lv_gif.h"
#include "driver/gpio.h"
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <stdint.h>
#include <sys/stat.h>
#include <time.h>
#include <sys/time.h>
#include <strings.h>
#include "esp_netif_sntp.h"
#include "esp_sntp.h"

static const char *TAG = "app_ui";

LV_FONT_DECLARE(font_alipuhui20);

lv_obj_t * main_obj; // 主界面
lv_obj_t * main_text_label; // 主界面 欢迎语
lv_obj_t * icon_in_obj; // 应用界面
int icon_flag; // 标记现在进入哪个应用 在主界面时为0

static void sdcard_clear_music_return(void);
static bool sdcard_restore_from_music(void);
static bool media_restore_from_music(void);

/******************************** 第1个图标 姿态传感器 应用程序*************************************************************************************/
lv_obj_t * label_x; // x角度值
lv_obj_t * label_y; // y角度值
lv_obj_t * label_z; // z角度值
lv_obj_t * x_bar;   // x角度bar
lv_obj_t * y_bar;   // y角度bar
lv_obj_t * z_bar;   // z角度bar

lv_obj_t * att_label; // 标题栏文字

lv_timer_t * my_lv_timer;

lv_obj_t *btn_att_back; // att姿态应用 后退按钮

static void att_clear_refs(void)
{
    label_x = NULL;
    label_y = NULL;
    label_z = NULL;
    x_bar = NULL;
    y_bar = NULL;
    z_bar = NULL;
    att_label = NULL;
    btn_att_back = NULL;
}

static int att_clamp_angle(float value)
{
    int angle = (int)roundf(value);
    if (angle < -100) {
        return -100;
    }
    if (angle > 100) {
        return 100;
    }
    return angle;
}

// 返回主界面按钮事件处理函数
static void btn_att_back_cb(lv_event_t * e)
{
    if (my_lv_timer != NULL) {
        lv_timer_del(my_lv_timer);
        my_lv_timer = NULL;
    }
    qmi8658_close(); // 关闭芯片运行
    if (icon_in_obj != NULL) {
        lv_obj_del(icon_in_obj); // 删除画布
        icon_in_obj = NULL;
    }
    att_clear_refs();
    icon_flag = 0;
}

// 定时更新姿态角度值
void att_update_cb(lv_timer_t * timer)
{
    if (icon_flag != 1 || icon_in_obj == NULL || label_x == NULL || x_bar == NULL) {
        return;
    }

    t_sQMI8658 QMI8658 = {0};
    int att_x, att_y, att_z;

    // 获取XYZ角度
    esp_err_t ret = qmi8658_fetch_angleFromAcc(&QMI8658);
    if (ret != ESP_OK) {
        if (att_label != NULL) {
            lv_label_set_text(att_label, "传感器等待");
        }
        return;
    }

    att_x = att_clamp_angle(QMI8658.AngleX);  // 四舍五入
    att_y = att_clamp_angle(QMI8658.AngleY);  // 四舍五入
    att_z = att_clamp_angle(QMI8658.AngleZ);  // 四舍五入

    // 更新角度值
    lv_label_set_text_fmt(label_x, "X: %d", att_x);
    lv_label_set_text_fmt(label_y, "Y: %d", att_y);
    lv_label_set_text_fmt(label_z, "Z: %d", att_z);
    // 更新角度bar
    lv_bar_set_start_value(x_bar, att_x-10, LV_ANIM_OFF);
    lv_bar_set_value(x_bar, att_x+10, LV_ANIM_OFF);
    lv_bar_set_start_value(y_bar, att_y-10, LV_ANIM_OFF);
    lv_bar_set_value(y_bar, att_y+10, LV_ANIM_OFF);
    lv_bar_set_start_value(z_bar, att_z-10, LV_ANIM_OFF);
    lv_bar_set_value(z_bar, att_z+10, LV_ANIM_OFF);

    // 判断运动状态
    uint8_t status = 0;
    ret = qmi8658_fetch_motion(&status);
    if (ret == ESP_OK && att_label != NULL) {
        if (status & 0x20) // 判断是否发生Any-Motion
        {
            lv_label_set_text(att_label, "运动或震动");
        }
        else if (status & 0x40) // 判断是否发生No-Motion
        {
            lv_label_set_text(att_label, "静止");
        }
        else if (status & 0x80) // 判断是否发生Significant-Motion
        {
            lv_label_set_text(att_label, "剧烈运动");
        }
    }
}

// 姿态监测处理任务
static void task_process_att(void *arg)
{
    esp_err_t ret = qmi8658_init();
    if (ret != ESP_OK){ // 如果传感器初始化不成功
        // 液晶屏提醒用户 传感器错误
        lvgl_port_lock(0);
        if (icon_flag == 1 && icon_in_obj != NULL) {
            if (att_label != NULL) {
                lv_label_set_text(att_label, "初始化失败");
            }
            lv_obj_t * label = lv_label_create(icon_in_obj);
            lv_label_set_text_fmt(label, "QMI8658传感器错误\n%s", esp_err_to_name(ret));
            lv_obj_set_style_text_color(label, lv_color_hex(0x000000), 0);
            lv_obj_set_style_text_font(label, &font_alipuhui20, 0);
            lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
            lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
        }
        lvgl_port_unlock();
    }
    else{ // 传感器初始化成功
        lvgl_port_lock(0);
        if (icon_flag != 1 || icon_in_obj == NULL) {
            lvgl_port_unlock();
            qmi8658_close();
            vTaskDelete(NULL);
            return;
        }

        // 显示x角度值
        label_x = lv_label_create(icon_in_obj);
        lv_label_set_text(label_x, "X:");
        lv_obj_set_style_text_color(label_x, lv_color_hex(0x000000), 0);
        lv_obj_set_style_text_font(label_x, &lv_font_montserrat_20, 0);
        lv_obj_align(label_x, LV_ALIGN_TOP_LEFT, 20, 60);
        // 显示x角度bar
        x_bar = lv_bar_create(icon_in_obj);
        lv_obj_set_size(x_bar, 200, 25);
        lv_obj_align(x_bar, LV_ALIGN_TOP_LEFT, 80, 60);
        lv_bar_set_mode(x_bar, LV_BAR_MODE_RANGE);
        lv_bar_set_range(x_bar, -101, 101);
        lv_bar_set_start_value(x_bar, -10, LV_ANIM_OFF);
        lv_bar_set_value(x_bar, 10, LV_ANIM_OFF);

        // 显示y角度值
        label_y = lv_label_create(icon_in_obj);
        lv_label_set_text(label_y, "Y:");
        lv_obj_set_style_text_color(label_y, lv_color_hex(0x000000), 0);
        lv_obj_set_style_text_font(label_y, &lv_font_montserrat_20, 0);
        lv_obj_align(label_y, LV_ALIGN_TOP_LEFT, 20, 120);
        // 显示y角度bar
        y_bar = lv_bar_create(icon_in_obj);
        lv_obj_set_size(y_bar, 200, 25);
        lv_obj_align(y_bar, LV_ALIGN_TOP_LEFT, 80, 120);
        lv_bar_set_mode(y_bar, LV_BAR_MODE_RANGE);
        lv_bar_set_range(y_bar, -101, 101);
        lv_bar_set_start_value(y_bar, -10, LV_ANIM_OFF);
        lv_bar_set_value(y_bar, 10, LV_ANIM_OFF);

