xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(MUSIC_DIR_PRIMARY, 0775);

    for (size_t i = 0; i < sizeof(dirs) / sizeof(dirs[0]); i++) {
        file_iterator_instance_t *iter = music_iterator_new_from_dir(dirs[i]);
        if (iter != NULL) {
            ESP_LOGI(TAG, "Music dir: %s, count=%u", dirs[i], (unsigned)iter->count);
            return iter;
        }
    }

    return NULL;
}

static bool music_has_tracks(void)
{
    return file_iterator != NULL && file_iterator->count > 0;
}

static const char *music_play_mode_text(music_play_mode_t mode)
{
    switch (mode) {
    case MUSIC_PLAY_MODE_STOP:
        return "停止";
    case MUSIC_PLAY_MODE_SEQUENCE:
        return "顺序";
    case MUSIC_PLAY_MODE_SINGLE_LOOP:
        return "单曲";
    case MUSIC_PLAY_MODE_LIST_LOOP:
    default:
        return "列表";
    }
}

static void music_update_mode_label(void)
{
    if (label_play_mode != NULL) {
        lv_label_set_text(label_play_mode, music_play_mode_text(g_music_play_mode));
    }
}

static void music_show_stopped(void)
{
    if (btn_play_pause != NULL) {
        lv_obj_clear_state(btn_play_pause, LV_STATE_CHECKED);
    }
    if (label_play_pause != NULL) {
        lv_label_set_text_static(label_play_pause, LV_SYMBOL_PLAY);
    }
}

static void music_play_mode_cb(lv_event_t *event)
{
    if (lv_event_get_code(event) != LV_EVENT_CLICKED) {
        return;
    }

    g_music_play_mode = (music_play_mode_t)((g_music_play_mode + 1) % 4);
    music_update_mode_label();
    ESP_LOGI(TAG, "music play mode: %s", music_play_mode_text(g_music_play_mode));
}

static void music_clear_ui_refs(void)
{
    music_list = NULL;
    label_play_pause = NULL;
    btn_play_pause = NULL;
    volume_slider = NULL;
    label_play_mode = NULL;
    music_title_label = NULL;
    btn_music_back = NULL;
}

static void music_player_release(void)
{
    if (g_audio_player_ready) {
        audio_player_stop();
        audio_player_delete();
        g_audio_player_ready = false;
    }
    music_iterator_free(file_iterator);
    file_iterator = NULL;
    g_audio_list_mode = true;
    g_music_play_mode = MUSIC_PLAY_MODE_LIST_LOOP;
}

// 播放指定序号的音乐
static void play_index(int index)
{
    if (!music_has_tracks()) {
        ESP_LOGW(TAG, "No music tracks available");
        return;
    }

    ESP_LOGI(TAG, "play_index(%d)", index);
    g_audio_list_mode = true;

    char filename[512];
    int retval = file_iterator_get_full_path_from_index(file_iterator, index, filename, sizeof(filename));
    if (retval == 0) {
        ESP_LOGE(TAG, "unable to retrieve filename");
        return;
    }

    FILE *fp = fopen(filename, "rb");
    if (fp) {
        ESP_LOGI(TAG, "Playing '%s'", filename);
        audio_player_play(fp);
    } else {
        ESP_LOGE(TAG, "unable to open index %d, filename '%s'", index, filename);
    }
}

// 设置声音处理函数
static esp_err_t _audio_player_mute_fn(AUDIO_PLAYER_MUTE_SETTING setting)
{
    esp_err_t ret = ESP_OK;
    // 判断是否需要静音
    bsp_codec_mute_set(setting == AUDIO_PLAYER_MUTE ? true : false);
    // 如果不是静音 设置音量
    if (setting == AUDIO_PLAYER_UNMUTE) {
        bsp_codec_volume_set(g_sys_volume, NULL);
    }
    ret = ESP_OK;

    return ret;
}

// 播放音乐函数 播放音乐的时候 会不断进入
static esp_err_t _audio_player_write_fn(void *audio_buffer, size_t len, size_t *bytes_written, uint32_t timeout_ms)
{
    esp_err_t ret = ESP_OK;

    ret = bsp_i2s_write(audio_buffer, len, bytes_written, timeout_ms);

    return ret;
}

// 设置采样率 播放的时候进入一次
static esp_err_t _audio_player_std_clock(uint32_t rate, uint32_t bits_cfg, i2s_slot_mode_t ch)
{
    esp_err_t ret = ESP_OK;

    ret = bsp_speaker_set_fs(rate, bits_cfg, ch);
    return ret;
}

// 回调函数 播放器每次动作都会进入
static void _audio_player_callback(audio_player_cb_ctx_t *ctx)
{
    ESP_LOGI(TAG, "ctx->audio_event = %d", ctx->audio_event);
    switch (ctx->audio_event) {
    case AUDIO_PLAYER_CALLBACK_EVENT_IDLE: {  // 播放完一首歌 进入这个case
        ESP_LOGI(TAG, "AUDIO_PLAYER_REQUEST_IDLE");
        if (!g_audio_list_mode || file_iterator == NULL || file_iterator->count == 0) {
            pa_en(0);
            lvgl_port_lock(0);
            music_show_stopped();
            lvgl_port_unlock();
            break;
        }

        int index = file_iterator_get_index(file_iterator);
        if (g_music_play_mode == MUSIC_PLAY_MODE_STOP) {
            pa_en(0);
            lvgl_port_lock(0);
            music_show_stopped();
            lvgl_port_unlock();
            break;
        }
        if (g_music_play_mode == MUSIC_PLAY_MODE_SINGLE_LOOP) {
            ESP_LOGI(TAG, "single loop index '%d'", index);
            play_index(index);
            break;
        }

        if (g_music_play_mode == MUSIC_PLAY_MODE_SEQUENCE) {
            if ((size_t)index + 1 >= file_iterator->count) {
                pa_en(0);
                lvgl_port_lock(0);
                music_show_stopped();
                lvgl_port_unlock();
                break;
            }
            index++;
            file_iterator_set_index(file_iterator, index);
        } else {
            file_iterator_next(file_iterator);
            index = file_iterator_get_index(file_iterator);
        }

        ESP_LOGI(TAG, "playing index '%d'", index);
        play_index(index);
        // 修改当前播放的音乐名称
        lvgl_port_lock(0);
        if (music_list != NULL) {
            lv_dropdown_set_selected(music_list, index);
        }
        lvgl_port_unlock();
        break;
    }
    case AUDIO_PLAYER_CALLBACK_EVENT_PLAYING: // 正在播放音乐
        ESP_LOGI(TAG, "AUDIO_PLAYER_REQUEST_PLAY");
        pa_en(1); // 打开音频功放
        break;
    case AUDIO_PLAYER_CALLBACK_EVENT_PAUSE: // 正在暂停音乐
        ESP_LOGI(TAG, "AUDIO_PLAYER_REQUEST_PAUSE");
        pa_en(0); // 关闭音频功放
        break;
    default:
        break;
    }
}

// mp3播放器初始化
void mp3_player_init(void)
{
    // 获取文件信息
    if (file_iterator == NULL) {
        file_iterator = music_iterator_new_from_sd();
    }

    // 初始化音频播放
    if (g_audio_player_ready) {
        g_audio_list_mode = true;
        return;
    }

