xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
static void sd_preview_large_file(const char *title, off_t file_size, size_t limit)
{
    char file_size_text[24];
    char limit_text[24];
    char message[192];

    sd_format_file_size(file_size_text, sizeof(file_size_text), file_size);
    sd_format_file_size(limit_text, sizeof(limit_text), (off_t)limit);
    snprintf(message, sizeof(message),
             "文件较大，已跳过自动预览\n大小: %s\n安全上限: %s\n\n请压缩或裁切后再预览",
             file_size_text, limit_text);
    sd_preview_message(title, message);
}

static void *sd_lv_fs_open(lv_fs_drv_t *drv, const char *path, lv_fs_mode_t mode)
{
    LV_UNUSED(drv);
    const char *flags = NULL;
    if (mode == LV_FS_MODE_WR) {
        flags = "wb";
    } else if (mode == LV_FS_MODE_RD) {
        flags = "rb";
    } else if (mode == (LV_FS_MODE_WR | LV_FS_MODE_RD)) {
        flags = "rb+";
    }
    return flags == NULL ? NULL : fopen(path, flags);
}

static lv_fs_res_t sd_lv_fs_close(lv_fs_drv_t *drv, void *file_p)
{
    LV_UNUSED(drv);
    fclose((FILE *)file_p);
    return LV_FS_RES_OK;
}

static lv_fs_res_t sd_lv_fs_read(lv_fs_drv_t *drv, void *file_p, void *buf, uint32_t btr, uint32_t *br)
{
    LV_UNUSED(drv);
    *br = fread(buf, 1, btr, (FILE *)file_p);
    return LV_FS_RES_OK;
}

static lv_fs_res_t sd_lv_fs_seek(lv_fs_drv_t *drv, void *file_p, uint32_t pos, lv_fs_whence_t whence)
{
    LV_UNUSED(drv);
    return fseek((FILE *)file_p, pos, whence) == 0 ? LV_FS_RES_OK : LV_FS_RES_UNKNOWN;
}

static lv_fs_res_t sd_lv_fs_tell(lv_fs_drv_t *drv, void *file_p, uint32_t *pos_p)
{
    LV_UNUSED(drv);
    long pos = ftell((FILE *)file_p);
    if (pos < 0) {
        return LV_FS_RES_UNKNOWN;
    }
    *pos_p = (uint32_t)pos;
    return LV_FS_RES_OK;
}

static void sd_lv_fs_init_once(void)
{
    if (s_lv_fs_ready) {
        return;
    }

    static lv_fs_drv_t fs_drv;
    lv_fs_drv_init(&fs_drv);
    fs_drv.letter = 'S';
    fs_drv.open_cb = sd_lv_fs_open;
    fs_drv.close_cb = sd_lv_fs_close;
    fs_drv.read_cb = sd_lv_fs_read;
    fs_drv.seek_cb = sd_lv_fs_seek;
    fs_drv.tell_cb = sd_lv_fs_tell;
    lv_fs_drv_register(&fs_drv);
    s_lv_fs_ready = true;
}

static void sd_preview_set_fullscreen(bool fullscreen)
{
    if (sdcard_preview_page == NULL || s_preview_bar == NULL || s_preview_body == NULL) {
        return;
    }

    s_preview_fullscreen = fullscreen;
    if (fullscreen) {
        lv_obj_add_flag(s_preview_bar, LV_OBJ_FLAG_HIDDEN);
        lv_obj_set_size(s_preview_body, SDCARD_PREVIEW_W, SDCARD_PREVIEW_FULL_H);
        lv_obj_align(s_preview_body, LV_ALIGN_TOP_LEFT, 0, 0);
    } else {
        lv_obj_clear_flag(s_preview_bar, LV_OBJ_FLAG_HIDDEN);
        lv_obj_set_size(s_preview_body, SDCARD_PREVIEW_W, SDCARD_PREVIEW_H);
        lv_obj_align(s_preview_body, LV_ALIGN_BOTTOM_LEFT, 0, 0);
    }
    if (s_preview_media_obj != NULL) {
        lv_obj_center(s_preview_media_obj);
    }
}

static void sd_preview_toggle_fullscreen_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) == LV_EVENT_CLICKED) {
        sd_preview_set_fullscreen(!s_preview_fullscreen);
    }
}

static void sd_preview_enable_fullscreen_toggle(lv_obj_t *body, lv_obj_t *media)
{
    s_preview_media_obj = media;
    lv_obj_add_flag(body, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(body, sd_preview_toggle_fullscreen_cb, LV_EVENT_CLICKED, NULL);
    if (media != NULL) {
        lv_obj_add_flag(media, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_add_event_cb(media, sd_preview_toggle_fullscreen_cb, LV_EVENT_CLICKED, NULL);
    }
}

static void sd_preview_clear_current(void)
{
    if (g_audio_player_ready && !g_audio_list_mode) {
        audio_player_stop();
    }
    if (sdcard_preview_page != NULL) {
        lv_obj_del(sdcard_preview_page);
        sdcard_preview_page = NULL;
    }
    s_preview_bar = NULL;
    s_preview_body = NULL;
    s_preview_media_obj = NULL;
    s_preview_fullscreen = false;
    if (s_preview_img_buf != NULL) {
        heap_caps_free(s_preview_img_buf);
        s_preview_img_buf = NULL;
    }
}

static void sd_preview_cleanup(void)
{
    s_sd_preview_generation++;
    sd_preview_clear_current();
}

static void sd_preview_back_cb(lv_event_t *e)
{
    sd_preview_cleanup();
}

static lv_obj_t *sd_preview_create_page(const char *title)
{
    sd_preview_clear_current();

    sdcard_preview_page = lv_obj_create(lv_scr_act());
    lv_obj_set_size(sdcard_preview_page, 320, 240);
    lv_obj_set_style_pad_all(sdcard_preview_page, 0, 0);
    lv_obj_set_style_border_width(sdcard_preview_page, 0, 0);
    lv_obj_set_style_radius(sdcard_preview_page, 0, 0);
    lv_obj_set_style_bg_color(sdcard_preview_page, lv_color_hex(0x101820), 0);

    lv_obj_t *bar = lv_obj_create(sdcard_preview_page);
    lv_obj_set_size(bar, 320, SDCARD_PREVIEW_TOP);
    lv_obj_align(bar, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_pad_all(bar, 0, 0);
    lv_obj_set_style_border_width(bar, 0, 0);
    lv_obj_set_style_radius(bar, 0, 0);
    lv_obj_set_style_bg_color(bar, lv_color_hex(0x008b8b), 0);
    s_preview_bar = bar;

    lv_obj_t *back = lv_btn_create(bar);
    lv_obj_set_size(back, 56, 34);
    lv_obj_align(back, LV_ALIGN_LEFT_MID, 2, 0);
    lv_obj_set_style_bg_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_set_style_shadow_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(back, sd_preview_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *back_label = lv_label_create(back);
    lv_label_set_text(back_label, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(back_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(back_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(back_label);

    lv_obj_t *title_label = lv_label_create(bar);
    lv_label_set_text(title_label, title);
    lv_obj_set_style_text_font(title_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_width(title_label, 210);
    lv_label_set_long_mode(title_label, LV_LABEL_LONG_SCROLL_CIRCULAR);
    lv_obj_align(title_label, LV_ALIGN_CENTER, 8, 0);

    lv_obj_t *body = lv_obj_create(sdcard_preview_page);
    lv_obj_set_size(body, 320, SDCARD_PREVIEW_H);
    lv_obj_align(body, LV_ALIGN_BOTTOM_LEFT, 0, 0);
    lv_obj_set_style_pad_all(body, 0, 0);
    lv_obj_set_style_border_width(body, 0, 0);
    lv_obj_set_style_radius(body, 0, 0);
    lv_obj_set_style_bg_color(body, lv_color_hex(0x101820), 0);
    s_preview_body = body;
    s_preview_media_obj = NULL;
    s_preview_fullscreen = false;
    return body;
}

static void sd_preview_message(const char *title, const char *message)
{
    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page(title);
    lv_obj_t *label = lv_label_create(body);
    lv_label_set_text(label, message);
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_font(label, &font_alipuhui20, 0);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(label, lv_color_hex(0xffffff), 0);
    lv_obj_set_width(label, 280);
    lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
    lvgl_port_unlock();
}

static void sd_preview_text(const char *path, off_t file_size)
{
    FILE *f = fopen(path, "rb");
    if (f == NULL) {
        sd_preview_message("文本预览", "文件打开失败");
        return;
    }

