xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    char *buf = heap_caps_malloc(SDCARD_TEXT_PREVIEW_LIMIT + SDCARD_TEXT_PREVIEW_EXTRA,
                                 MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    if (buf == NULL) {
        fclose(f);
        sd_preview_message("文本预览", "内存不足");
        return;
    }

    size_t len = fread(buf, 1, SDCARD_TEXT_PREVIEW_LIMIT, f);
    bool truncated = !feof(f);
    fclose(f);
    buf[len] = '\0';
    if (truncated || file_size > (off_t)SDCARD_TEXT_PREVIEW_LIMIT) {
        snprintf(buf + len, SDCARD_TEXT_PREVIEW_EXTRA, "\n\n...仅显示前 %u KB",
                 (unsigned)(SDCARD_TEXT_PREVIEW_LIMIT / 1024));
    }

    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page("文本预览");
    lv_obj_t *ta = lv_textarea_create(body);
    lv_obj_set_size(ta, 312, 192);
    lv_obj_align(ta, LV_ALIGN_CENTER, 0, 0);
    lv_textarea_set_text(ta, buf);
    lv_textarea_set_cursor_click_pos(ta, false);
    lv_obj_set_style_text_font(ta, &font_alipuhui20, 0);
    lvgl_port_unlock();

    heap_caps_free(buf);
}

static void sd_build_lv_path(const char *path, char *out, size_t out_len)
{
    snprintf(out, out_len, "S:%s", path);
}

static void sd_preview_png(const char *path)
{
    sd_lv_fs_init_once();
    char lv_path[540];
    sd_build_lv_path(path, lv_path, sizeof(lv_path));

    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page("PNG预览");
    lv_obj_set_scrollbar_mode(body, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_t *img = lv_img_create(body);
    lv_img_set_src(img, lv_path);
    lv_obj_center(img);
    sd_preview_enable_fullscreen_toggle(body, img);
    lvgl_port_unlock();
}

static void sd_preview_gif(const char *path)
{
    sd_lv_fs_init_once();
    char lv_path[540];
    sd_build_lv_path(path, lv_path, sizeof(lv_path));

    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page("GIF动图");
    lv_obj_set_scrollbar_mode(body, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_t *gif = lv_gif_create(body);
    lv_gif_set_src(gif, lv_path);
    lv_obj_center(gif);
    sd_preview_enable_fullscreen_toggle(body, gif);
    lvgl_port_unlock();
}

static esp_jpeg_image_scale_t sd_choose_jpeg_scale(int width, int height)
{
    if (width / 8 >= SDCARD_PREVIEW_W && height / 8 >= SDCARD_PREVIEW_H) {
        return JPEG_IMAGE_SCALE_1_8;
    }
    if (width / 4 >= SDCARD_PREVIEW_W && height / 4 >= SDCARD_PREVIEW_H) {
        return JPEG_IMAGE_SCALE_1_4;
    }
    if (width / 2 >= SDCARD_PREVIEW_W && height / 2 >= SDCARD_PREVIEW_H) {
        return JPEG_IMAGE_SCALE_1_2;
    }
    return JPEG_IMAGE_SCALE_0;
}

static uint16_t *sd_center_crop_canvas(const uint16_t *pixels, int width, int height, int target_w, int target_h)
{
    uint16_t *canvas = heap_caps_malloc(target_w * target_h * sizeof(uint16_t),
                                        MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    if (canvas == NULL) {
        return NULL;
    }

    memset(canvas, 0, target_w * target_h * sizeof(uint16_t));
    int src_x = width > target_w ? (width - target_w) / 2 : 0;
    int src_y = height > target_h ? (height - target_h) / 2 : 0;
    int copy_w = width > target_w ? target_w : width;
    int copy_h = height > target_h ? target_h : height;
    int dst_x = width < target_w ? (target_w - width) / 2 : 0;
    int dst_y = height < target_h ? (target_h - height) / 2 : 0;

    for (int y = 0; y < copy_h; y++) {
        const uint16_t *src = pixels + (src_y + y) * width + src_x;
        uint16_t *dst = canvas + (dst_y + y) * target_w + dst_x;
        memcpy(dst, src, copy_w * sizeof(uint16_t));
    }
    return canvas;
}

static void sd_preview_jpeg_task(void *arg)
{
    sd_jpeg_preview_req_t *req = (sd_jpeg_preview_req_t *)arg;
    char path[512];
    uint32_t generation = req->generation;
    snprintf(path, sizeof(path), "%s", req->path);
    free(req);

    FILE *f = fopen(path, "rb");
    if (f == NULL) {
        if (generation == s_sd_preview_generation) {
            sd_preview_message("JPG预览", "文件打开失败");
        }
        vTaskDelete(NULL);
        return;
    }
    fseek(f, 0, SEEK_END);
    long file_len = ftell(f);
    rewind(f);
    if (file_len <= 0 || file_len > SDCARD_IMAGE_PREVIEW_LIMIT) {
        fclose(f);
        if (generation == s_sd_preview_generation) {
            sd_preview_message("JPG预览", "图片过大或为空");
        }
        vTaskDelete(NULL);
        return;
    }

    uint8_t *jpeg = heap_caps_malloc(file_len, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    if (jpeg == NULL) {
        fclose(f);
        if (generation == s_sd_preview_generation) {
            sd_preview_message("JPG预览", "内存不足");
        }
        vTaskDelete(NULL);
        return;
    }
    size_t got = fread(jpeg, 1, file_len, f);
    fclose(f);
    if (got != (size_t)file_len) {
        heap_caps_free(jpeg);
        if (generation == s_sd_preview_generation) {
            sd_preview_message("JPG预览", "读取失败");
        }
        vTaskDelete(NULL);
        return;
    }

    esp_jpeg_image_cfg_t info_cfg = {
        .indata = jpeg,
        .indata_size = got,
        .out_format = JPEG_IMAGE_FORMAT_RGB565,
        .out_scale = JPEG_IMAGE_SCALE_0,
        .flags = {
            .swap_color_bytes = 1,
        },
    };
    esp_jpeg_image_output_t original = { 0 };
    esp_err_t ret = esp_jpeg_get_image_info(&info_cfg, &original);
    if (ret == ESP_OK) {
        info_cfg.out_scale = sd_choose_jpeg_scale(original.width, original.height);
        esp_jpeg_image_output_t outimg = { 0 };
        ret = esp_jpeg_get_image_info(&info_cfg, &outimg);
        if (ret == ESP_OK) {
            uint16_t *decoded = heap_caps_malloc(outimg.output_len, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
            if (decoded == NULL) {
                ret = ESP_ERR_NO_MEM;
            } else {
                esp_jpeg_image_cfg_t jpeg_cfg = info_cfg;
                jpeg_cfg.outbuf = (uint8_t *)decoded;
                jpeg_cfg.outbuf_size = outimg.output_len;
                ret = esp_jpeg_decode(&jpeg_cfg, &outimg);
                if (ret == ESP_OK) {
                    uint16_t *canvas = sd_center_crop_canvas(decoded, outimg.width, outimg.height,
                                                             SDCARD_PREVIEW_W, SDCARD_PREVIEW_FULL_H);
                    if (canvas == NULL) {
                        ret = ESP_ERR_NO_MEM;
                    } else {
                        if (generation == s_sd_preview_generation) {
                            lvgl_port_lock(0);
                            lv_obj_t *body = sd_preview_create_page("JPG预览");
                            s_preview_img_buf = (uint8_t *)canvas;
                            s_preview_img_dsc.header.cf = LV_IMG_CF_TRUE_COLOR;
                            s_preview_img_dsc.header.always_zero = 0;
                            s_preview_img_dsc.header.reserved = 0;
                            s_preview_img_dsc.header.w = SDCARD_PREVIEW_W;
                            s_preview_img_dsc.header.h = SDCARD_PREVIEW_FULL_H;
                            s_preview_img_dsc.data_size = SDCARD_PREVIEW_W * SDCARD_PREVIEW_FULL_H * sizeof(uint16_t);
                            s_preview_img_dsc.data = s_preview_img_buf;
                            lv_obj_t *img = lv_img_create(body);
                            lv_img_set_src(img, &s_preview_img_dsc);
                            lv_obj_center(img);
                            sd_preview_enable_fullscreen_toggle(body, img);
                            lvgl_port_unlock();
                        } else {
                            heap_caps_free(canvas);
                        }
                    }
                }
                heap_caps_free(decoded);
            }
        }
    }
    heap_caps_free(jpeg);
    if (ret != ESP_OK && generation == s_sd_preview_generation) {
        ESP_LOGW(TAG, "jpeg preview failed: %s", esp_err_to_name(ret));
        sd_preview_message("JPG预览", "解码失败");
    }
    vTaskDelete(NULL);
}

static void sd_preview_jpeg(const char *path, uint32_t generation)
{
    sd_preview_message("JPG预览", "载入中...");
    sd_jpeg_preview_req_t *req = malloc(sizeof(*req));
    if (req != NULL) {
        snprintf(req->path, sizeof(req->path), "%s", path);
        req->generation = generation;
    }
    if (req == NULL ||
        xTaskCreatePinnedToCore(sd_preview_jpeg_task, "jpg_preview", 8192, req, 4, NULL, 1) != pdPASS) {
        free(req);
        sd_preview_message("JPG预览", "任务创建失败");
    }
}

static bool music_open_from_path(const char *path, bool return_to_sdcard)
{
    size_t selected = 0;
    if (!music_prepare_from_path(path, &selected)) {
        return false;
    }

    mp3_player_init();
    if (!g_audio_player_ready) {
        music_player_release();
        return false;
    }

