xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    if (return_to_sdcard) {
        sdcard_remember_music_return();
    }
    sd_preview_cleanup();
    if (icon_in_obj != NULL) {
        lv_obj_del(icon_in_obj);
        icon_in_obj = NULL;
    }
    sdcard_title = NULL;
    sdcard_label = NULL;
    sdcard_file_list = NULL;

    g_music_play_mode = MUSIC_PLAY_MODE_STOP;
    music_create_page("音乐播放器");
    lvgl_port_lock(0);
    if (music_list != NULL) {
        lv_dropdown_set_selected(music_list, selected);
    }
    if (btn_play_pause != NULL) {
        lv_obj_add_state(btn_play_pause, LV_STATE_CHECKED);
    }
    if (label_play_pause != NULL) {
        lv_label_set_text_static(label_play_pause, LV_SYMBOL_PAUSE);
    }
    lvgl_port_unlock();
    play_index((int)selected);
    return true;
}

static void sd_preview_file(const char *path, sd_file_type_t type, off_t file_size)
{
    switch (type) {
    case SD_FILE_AUDIO:
        if (!music_open_from_path(path, true)) {
            sd_preview_message("音频播放", "播放器初始化失败");
        }
        break;
    case SD_FILE_IMAGE_JPEG:
        if (file_size <= 0 || file_size > (off_t)SDCARD_IMAGE_PREVIEW_LIMIT) {
            sd_preview_large_file("JPG预览", file_size, SDCARD_IMAGE_PREVIEW_LIMIT);
            break;
        }
        s_sd_preview_generation++;
        sd_preview_jpeg(path, s_sd_preview_generation);
        break;
    case SD_FILE_IMAGE_PNG:
        if (file_size <= 0 || file_size > (off_t)SDCARD_PNG_PREVIEW_LIMIT) {
            sd_preview_large_file("PNG预览", file_size, SDCARD_PNG_PREVIEW_LIMIT);
            break;
        }
        sd_preview_png(path);
        break;
    case SD_FILE_IMAGE_GIF:
        if (file_size <= 0 || file_size > (off_t)SDCARD_GIF_PREVIEW_LIMIT) {
            sd_preview_large_file("GIF动图", file_size, SDCARD_GIF_PREVIEW_LIMIT);
            break;
        }
        sd_preview_gif(path);
        break;
    case SD_FILE_TEXT:
        sd_preview_text(path, file_size);
        break;
    case SD_FILE_VIDEO:
        {
            char size_text[24];
            char message[96];
            sd_format_file_size(size_text, sizeof(size_text), file_size);
            snprintf(message, sizeof(message), "暂未支持视频播放\n文件大小: %s", size_text);
            sd_preview_message("视频文件", message);
        }
        break;
    default:
        sd_preview_message("文件", "暂不支持预览");
        break;
    }
}

static void sdmgr_build_info_text(char *out, size_t out_len, const bsp_sdcard_info_t *info, esp_err_t ret)
{
    if (ret != ESP_OK) {
        snprintf(out, out_len, "TF卡不可用\n错误: %s", esp_err_to_name(ret));
        return;
    }

    char card_size[24];
    sd_format_bytes_u64(card_size, sizeof(card_size), info->card_bytes);
    int used = snprintf(out, out_len,
                        "容量: %s  扇区:%luB\n挂载: %s  分区表:%s  分区:%u\n",
                        card_size,
                        (unsigned long)info->sector_size,
                        info->filesystem,
                        sd_partition_table_name(info->table_type),
                        (unsigned)info->partition_count);

    if (used < 0 || used >= (int)out_len) {
        return;
    }

    for (uint8_t i = 0; i < info->partition_count && used < (int)out_len - 1; i++) {
        const bsp_sdcard_partition_info_t *part = &info->partitions[i];
        if (!part->valid) {
            continue;
        }
        char part_size[24];
        sd_format_bytes_u64(part_size, sizeof(part_size), part->sectors * (uint64_t)info->sector_size);
        used += snprintf(out + used, out_len - used,
                         "#%u %s %s\nLBA %llu-%llu\n",
                         (unsigned)part->index,
                         part_size,
                         part->name,
                         (unsigned long long)part->first_lba,
                         (unsigned long long)part->last_lba);
    }

    if (info->partition_count == 0 && used < (int)out_len - 1) {
        used += snprintf(out + used, out_len - used, "未发现分区条目，可能是裸FAT卷。\n");
    }

    if (used < (int)out_len - 1) {
        snprintf(out + used, out_len - used,
                 "\n高级: USB-ZIP/FDD/HDD 属于PC BIOS启动盘布局；本机当前作为TF数据卡使用。多分区可识别，挂载切换待实现。");
    }
}

static void sdmgr_refresh_task(void *arg)
{
    (void)arg;
    bsp_sdcard_info_t info;
    char info_text[768];
    esp_err_t ret = bsp_sdcard_get_info(&info);
    sdmgr_build_info_text(info_text, sizeof(info_text), &info, ret);

    lvgl_port_lock(0);
    if (s_sdmgr_status_label != NULL) {
        lv_label_set_text(s_sdmgr_status_label, ret == ESP_OK ? "Ready" : "读取失败");
    }
    if (s_sdmgr_info_label != NULL) {
        lv_label_set_text(s_sdmgr_info_label, info_text);
    }
    lvgl_port_unlock();

    s_sd_manager_task_handle = NULL;
    vTaskDelete(NULL);
}

static void sdmgr_start_refresh(void)
{
    if (s_sd_manager_task_handle != NULL || s_sd_format_task_handle != NULL) {
        return;
    }
    if (s_sdmgr_status_label != NULL) {
        lv_label_set_text(s_sdmgr_status_label, "扫描中...");
    }
    if (xTaskCreatePinnedToCore(sdmgr_refresh_task, "sdmgr_refresh", 5 * 1024,
                                NULL, 4, &s_sd_manager_task_handle, 1) != pdPASS) {
        s_sd_manager_task_handle = NULL;
        if (s_sdmgr_status_label != NULL) {
            lv_label_set_text(s_sdmgr_status_label, "任务创建失败");
        }
    }
}

static void sdmgr_prepare_task(void *arg)
{
    (void)arg;
    esp_err_t ret = bsp_sdcard_prepare_product_dirs();
    bsp_sdcard_info_t info;
    char info_text[768];
    esp_err_t info_ret = bsp_sdcard_get_info(&info);
    sdmgr_build_info_text(info_text, sizeof(info_text), &info, info_ret);

    lvgl_port_lock(0);
    if (s_sdmgr_status_label != NULL) {
        lv_label_set_text(s_sdmgr_status_label, ret == ESP_OK ? "目录已初始化" : "目录初始化失败");
    }
    if (s_sdmgr_info_label != NULL) {
        lv_label_set_text(s_sdmgr_info_label, info_text);
    }
    lvgl_port_unlock();

    s_sd_manager_task_handle = NULL;
    vTaskDelete(NULL);
}

static void sdmgr_prepare_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED ||
        s_sd_manager_task_handle != NULL || s_sd_format_task_handle != NULL) {
        return;
    }
    if (s_sdmgr_status_label != NULL) {
        lv_label_set_text(s_sdmgr_status_label, "初始化目录...");
    }
    if (xTaskCreatePinnedToCore(sdmgr_prepare_task, "sdmgr_dirs", 5 * 1024,
                                NULL, 4, &s_sd_manager_task_handle, 1) != pdPASS) {
        s_sd_manager_task_handle = NULL;
        if (s_sdmgr_status_label != NULL) {
            lv_label_set_text(s_sdmgr_status_label, "任务创建失败");
        }
    }
}

