xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
static void sdmgr_refresh_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) == LV_EVENT_CLICKED) {
        sdmgr_start_refresh();
    }
}

static void sd_format_task(void *arg)
{
    bsp_sdcard_format_t format = (bsp_sdcard_format_t)(uintptr_t)arg;

    lvgl_port_lock(0);
    if (s_sdmgr_status_label != NULL) {
        lv_label_set_text_fmt(s_sdmgr_status_label, "格式化%s...", sd_format_name(format));
    }
    lvgl_port_unlock();

    int fatfs_result = 0;
    esp_err_t ret = bsp_sdcard_format_with_result(format, &fatfs_result);
    bsp_sdcard_info_t info;
    char info_text[768];
    esp_err_t info_ret = bsp_sdcard_get_info(&info);
    sdmgr_build_info_text(info_text, sizeof(info_text), &info, info_ret);
    s_sd_format_confirm = false;

    lvgl_port_lock(0);
    if (s_sdmgr_status_label != NULL) {
        if (ret == ESP_OK) {
            lv_label_set_text(s_sdmgr_status_label, "格式化完成");
        } else {
            lv_label_set_text_fmt(s_sdmgr_status_label, "格式化失败:%d", fatfs_result);
        }
    }
    if (s_sdmgr_info_label != NULL) {
        lv_label_set_text(s_sdmgr_info_label, info_text);
    }
    sd_update_format_labels();
    lvgl_port_unlock();

    s_sd_format_task_handle = NULL;
    vTaskDelete(NULL);
}

static void sd_format_cycle_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED ||
        s_sd_format_task_handle != NULL || s_sd_manager_task_handle != NULL) {
        return;
    }

    s_sd_format_confirm = false;
    if (s_sd_format_target == BSP_SDCARD_FORMAT_AUTO) {
        s_sd_format_target = BSP_SDCARD_FORMAT_FAT32;
    } else if (s_sd_format_target == BSP_SDCARD_FORMAT_FAT32) {
        s_sd_format_target = BSP_SDCARD_FORMAT_EXFAT;
    } else {
        s_sd_format_target = BSP_SDCARD_FORMAT_AUTO;
    }

    sd_update_format_labels();
    if (s_sdmgr_status_label != NULL) {
        lv_label_set_text_fmt(s_sdmgr_status_label, "格式:%s", sd_format_name(s_sd_format_target));
    }
}

static void sd_format_confirm_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED ||
        s_sd_format_task_handle != NULL || s_sd_manager_task_handle != NULL) {
        return;
    }

    if (!s_sd_format_confirm) {
        s_sd_format_confirm = true;
        sd_update_format_labels();
        if (s_sdmgr_status_label != NULL) {
            lv_label_set_text_fmt(s_sdmgr_status_label, "再点OK?格式化%s", sd_format_name(s_sd_format_target));
        }
        return;
    }

    s_sd_format_confirm = false;
    sd_update_format_labels();
    if (xTaskCreatePinnedToCore(sd_format_task, "sd_format", 6 * 1024,
                                (void *)(uintptr_t)s_sd_format_target,
                                4, &s_sd_format_task_handle, 1) != pdPASS) {
        s_sd_format_task_handle = NULL;
        if (s_sdmgr_status_label != NULL) {
            lv_label_set_text(s_sdmgr_status_label, "格式化任务失败");
        }
    }
}

// 返回主界面按钮事件处理函数
static void btn_sdback_cb(lv_event_t * e)
{
    if (s_sd_format_task_handle != NULL) {
        return;
    }
    s_sd_format_confirm = false;
    s_sd_fs_button_label = NULL;
    s_sd_fmt_button_label = NULL;

    if (file_path_info.path_index == 0){ // 如果当前是根目录
        sd_preview_cleanup();
        bsp_sdcard_unmount(); // 卸载SD卡
        lv_obj_del(icon_in_obj); // 回到主界面
        icon_flag = 0;
    }else{
        lv_obj_clean(sdcard_file_list); // 清除当前wifi列表
        esp_err_t ret = list_sdcard_files(file_path_info.path_back); // 列出上一级目录文件
        if (ret == ESP_OK){ // 如果成功列出目录
            strcpy(file_path_info.path_now, file_path_info.path_back); // 刚刚进入的这个目录路径 变成当前路径
            file_path_info.path_index--; // 目录级数索引退一级
            // 计算再向下退一级的目录路径
            char *slash = strrchr(file_path_info.path_back, '/'); // 从后往前查找字符'/'
            if (slash!= NULL) { // 如果查找到
                *slash = '\0'; // 替换为NULL 表示字符串结束
            }
            ESP_LOGI(TAG, "path_index: %d", file_path_info.path_index);
            ESP_LOGI(TAG, "path_now: %s", file_path_info.path_now);
            ESP_LOGI(TAG, "path_back: %s", file_path_info.path_back);
        }
    }
}

static void sdcard_create_page_shell(const char *title_text)
{
    static lv_style_t style;
    static bool style_ready;
    if (!style_ready) {
        lv_style_init(&style);
        lv_style_set_radius(&style, 10);
        lv_style_set_bg_opa(&style, LV_OPA_COVER);
        lv_style_set_bg_color(&style, lv_color_hex(0xffffff));
        lv_style_set_border_width(&style, 0);
        lv_style_set_pad_all(&style, 0);
        lv_style_set_width(&style, 320);
        lv_style_set_height(&style, 240);
        style_ready = true;
    }

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    sdcard_title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(sdcard_title, 320, 40);
    lv_obj_set_style_pad_all(sdcard_title, 0, 0);
    lv_obj_align(sdcard_title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(sdcard_title, lv_color_hex(0x008b8b), 0);

    sdcard_label = lv_label_create(sdcard_title);
    lv_label_set_text(sdcard_label, title_text);
    lv_obj_set_style_text_color(sdcard_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_text_font(sdcard_label, &font_alipuhui20, 0);
    lv_obj_align(sdcard_label, LV_ALIGN_CENTER, 0, 0);

    icon_flag = 3;
}

static void sdcard_create_nav_and_list(void)
{
    lv_obj_t *btn_back = lv_btn_create(sdcard_title);
    lv_obj_align(btn_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_back, 60, 30);
    lv_obj_set_style_border_width(btn_back, 0, 0);
    lv_obj_set_style_pad_all(btn_back, 0, 0);
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_add_event_cb(btn_back, btn_sdback_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label_back = lv_label_create(btn_back);
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0);
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    sdcard_file_list = lv_list_create(icon_in_obj);
    lv_obj_set_size(sdcard_file_list, 320, 200);
    lv_obj_align(sdcard_file_list, LV_ALIGN_TOP_LEFT, 0, 40);
    lv_obj_set_style_border_width(sdcard_file_list, 0, 0);
    lv_obj_set_style_text_font(sdcard_file_list, &font_alipuhui20, 0);
    lv_obj_set_scrollbar_mode(sdcard_file_list, LV_SCROLLBAR_MODE_OFF);
}

static bool sdcard_restore_from_music(void)
{
    if (!s_music_return_to_sdcard) {
        return false;
    }

    struct file_path_info saved = s_music_return_path;
    sdcard_clear_music_return();

    if (bsp_sdcard_mount() != ESP_OK) {
        icon_flag = 0;
        return false;
    }

    file_path_info = saved;
    sdcard_create_page_shell("TF卡");
    if (sdmmc_card != NULL) {
        lv_label_set_text_fmt(sdcard_label, "SD: %lluGB",
            (((uint64_t)sdmmc_card->csd.capacity) * sdmmc_card->csd.sector_size) >> 30);
    }
    sdcard_create_nav_and_list();
    if (list_sdcard_files(file_path_info.path_now) != ESP_OK) {
        lv_label_set_text(sdcard_label, "目录读取失败");
    }
    return true;
}

