xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
static lv_obj_t *sdmgr_create_button(lv_obj_t *parent, const char *text, int x, int y, int w,
                                     lv_color_t color, lv_event_cb_t cb)
{
    lv_obj_t *btn = lv_btn_create(parent);
    lv_obj_set_size(btn, w, 32);
    lv_obj_align(btn, LV_ALIGN_TOP_LEFT, x, y);
    lv_obj_set_style_radius(btn, 6, 0);
    lv_obj_set_style_border_width(btn, 0, 0);
    lv_obj_set_style_shadow_opa(btn, LV_OPA_TRANSP, 0);
    lv_obj_set_style_bg_color(btn, color, 0);
    lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, 0);
    lv_obj_add_event_cb(btn, cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label = lv_label_create(btn);
    lv_label_set_text(label, text);
    lv_obj_set_style_text_font(label, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(label, lv_color_hex(0xffffff), 0);
    lv_obj_center(label);
    return label;
}

static void btn_sdmgr_back_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED ||
        s_sd_manager_task_handle != NULL || s_sd_format_task_handle != NULL) {
        return;
    }

    s_sd_format_confirm = false;
    s_sd_fs_button_label = NULL;
    s_sd_fmt_button_label = NULL;
    s_sdmgr_status_label = NULL;
    s_sdmgr_info_label = NULL;
    bsp_sdcard_unmount();
    lv_obj_del(icon_in_obj);
    icon_flag = 0;
}

static void sdmgr_event_handler(lv_event_t *e)
{
    (void)e;
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 0);
    lv_style_set_bg_opa(&style, LV_OPA_COVER);
    lv_style_set_bg_color(&style, lv_color_hex(0x0f1720));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);
    lv_style_set_height(&style, 240);

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    lv_obj_t *title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(title, 320, 40);
    lv_obj_align(title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_pad_all(title, 0, 0);
    lv_obj_set_style_border_width(title, 0, 0);
    lv_obj_set_style_bg_color(title, lv_color_hex(0x176b78), 0);

    lv_obj_t *btn_back = lv_btn_create(title);
    lv_obj_align(btn_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_back, 56, 34);
    lv_obj_set_style_border_width(btn_back, 0, 0);
    lv_obj_set_style_pad_all(btn_back, 0, 0);
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, 0);
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(btn_back, btn_sdmgr_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label_back = lv_label_create(btn_back);
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0);
    lv_obj_center(label_back);

    lv_obj_t *title_label = lv_label_create(title);
    lv_label_set_text(title_label, "TF管理");
    lv_obj_set_style_text_font(title_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(title_label);

    s_sdmgr_status_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_sdmgr_status_label, "扫描中...");
    lv_obj_set_style_text_font(s_sdmgr_status_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_sdmgr_status_label, lv_color_hex(0xd9f4f6), 0);
    lv_obj_set_width(s_sdmgr_status_label, 300);
    lv_label_set_long_mode(s_sdmgr_status_label, LV_LABEL_LONG_DOT);
    lv_obj_align(s_sdmgr_status_label, LV_ALIGN_TOP_MID, 0, 44);

    lv_obj_t *info_panel = lv_obj_create(icon_in_obj);
    lv_obj_set_size(info_panel, 304, 124);
    lv_obj_align(info_panel, LV_ALIGN_TOP_LEFT, 8, 70);
    lv_obj_set_style_radius(info_panel, 6, 0);
    lv_obj_set_style_border_width(info_panel, 0, 0);
    lv_obj_set_style_bg_color(info_panel, lv_color_hex(0x172331), 0);
    lv_obj_set_style_pad_all(info_panel, 6, 0);
    lv_obj_set_scrollbar_mode(info_panel, LV_SCROLLBAR_MODE_AUTO);

    s_sdmgr_info_label = lv_label_create(info_panel);
    lv_label_set_text(s_sdmgr_info_label, "读取中...");
    lv_label_set_long_mode(s_sdmgr_info_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_width(s_sdmgr_info_label, 288);
    lv_obj_set_style_text_font(s_sdmgr_info_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_sdmgr_info_label, lv_color_hex(0xffffff), 0);
    lv_obj_align(s_sdmgr_info_label, LV_ALIGN_TOP_LEFT, 0, 0);

    sdmgr_create_button(icon_in_obj, "REF", 6, 202, 48, lv_color_hex(0x287b8f), sdmgr_refresh_cb);
    s_sd_fs_button_label = sdmgr_create_button(icon_in_obj, "FS", 60, 202, 82, lv_color_hex(0x365b80), sd_format_cycle_cb);
    sdmgr_create_button(icon_in_obj, "DIR", 148, 202, 82, lv_color_hex(0x2f7a55), sdmgr_prepare_cb);
    s_sd_fmt_button_label = sdmgr_create_button(icon_in_obj, "FMT", 236, 202, 78, lv_color_hex(0x9b2c2c), sd_format_confirm_cb);
    sd_update_format_labels();

    icon_flag = 9;
    sdmgr_start_refresh();
}



/******************************** 第4个图标 摄像头 应用程序 *****************************************************************************/
lv_obj_t * img_camera;
lv_obj_t * camera_status_label;
static uint8_t *s_camera_display_buf;
static volatile bool s_camera_save_requested;
static TaskHandle_t s_camera_task_handle;
static lv_obj_t *s_camera_page;
static volatile bool s_camera_running;

// 摄像头图像
lv_img_dsc_t img_camera_dsc = {
  .header.cf = LV_IMG_CF_TRUE_COLOR,
  .header.always_zero = 0,
  .header.reserved = 0,
  .header.w = 320,
  .header.h = 240,
  .data_size = 240*320*2,
};

static void camera_set_status(const char *text)
{
    lvgl_port_lock(0);
    if (camera_status_label != NULL) {
        lv_label_set_text(camera_status_label, text);
    }
    lvgl_port_unlock();
}

static void camera_save_frame(camera_fb_t *frame)
{
    camera_set_status("保存中...");

    if (bsp_sdcard_mount() != ESP_OK) {
        camera_set_status("TF卡不可用");
        return;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/photos", 0775);

    uint8_t *jpg_buf = NULL;
    size_t jpg_len = 0;
    bool ok = frame2jpg(frame, 80, &jpg_buf, &jpg_len);
    if (!ok || jpg_buf == NULL || jpg_len == 0) {
        camera_set_status("编码失败");
        return;
    }

    char path[128];
    snprintf(path, sizeof(path), SD_MOUNT_POINT "/szpi/photos/photo_%lld.jpg", esp_timer_get_time() / 1000);
    FILE *f = fopen(path, "wb");
    if (f == NULL) {
        free(jpg_buf);
        camera_set_status("保存失败");
        return;
    }

    size_t written = fwrite(jpg_buf, 1, jpg_len, f);
    fclose(f);
    free(jpg_buf);
    camera_set_status(written == jpg_len ? "已保存到TF卡" : "写入失败");
}

// 摄像头处理任务
static void task_process_camera(void *arg)
{
    lv_obj_t *page = (lv_obj_t *)arg;
    bool camera_started = false;
    const size_t frame_bytes = 240 * 320 * 2;
    if (s_camera_display_buf == NULL) {
        s_camera_display_buf = heap_caps_malloc(frame_bytes, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    }
    if (s_camera_display_buf == NULL) {
        camera_set_status("显示缓冲不足");
        icon_flag = 0;
        goto cleanup;
    }

    memset(s_camera_display_buf, 0xff, frame_bytes);
    img_camera_dsc.data = s_camera_display_buf;
    lvgl_port_lock(0);
    if (img_camera != NULL) {
        lv_img_set_src(img_camera, &img_camera_dsc);
    }
    lvgl_port_unlock();

    camera_set_status("摄像头启动中...");
    esp_err_t ret = bsp_camera_init();
    if (ret != ESP_OK) {
        char msg[48];
        snprintf(msg, sizeof(msg), "摄像头失败:%s", esp_err_to_name(ret));
        camera_set_status(msg);
        vTaskDelay(pdMS_TO_TICKS(1200));
        icon_flag = 0;
        goto cleanup;
    }

