xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    camera_started = true;
    camera_set_status("Ready");
    int null_frame_count = 0;

    while (icon_flag == 4)
    {
        camera_fb_t *frame = esp_camera_fb_get();
        if (frame == NULL) {
            if (s_camera_save_requested && null_frame_count == 0) {
                camera_set_status("等待画面...");
            }
            null_frame_count++;
            if (null_frame_count > 80) {
                camera_set_status("摄像头无画面");
                null_frame_count = 0;
            }
            vTaskDelay(pdMS_TO_TICKS(30));
            continue;
        }
        null_frame_count = 0;

        if (s_camera_save_requested) {
            s_camera_save_requested = false;
            camera_save_frame(frame);
        }

        size_t copy_len = frame->len < frame_bytes ? frame->len : frame_bytes;
        memcpy(s_camera_display_buf, frame->buf, copy_len);
        if (copy_len < frame_bytes) {
            memset(s_camera_display_buf + copy_len, 0, frame_bytes - copy_len);
        }
        img_camera_dsc.data = s_camera_display_buf;
        lvgl_port_lock(0);
        if (img_camera != NULL) {
            lv_img_set_src(img_camera, &img_camera_dsc);
        }
        lvgl_port_unlock();
        esp_camera_fb_return(frame);
        vTaskDelay(pdMS_TO_TICKS(30));
    }
cleanup:
    if (camera_started) {
        esp_camera_deinit(); // 取消初始化摄像头
        vTaskDelay(pdMS_TO_TICKS(30));
    }
    dvp_pwdn(1); // 摄像头进入掉电模式
    lvgl_port_lock(0);
    if (page != NULL) {
        lv_obj_del(page); // 删除摄像头画布
    }
    if (icon_in_obj == page) {
        icon_in_obj = NULL;
    }
    if (s_camera_page == page) {
        s_camera_page = NULL;
        img_camera = NULL;
        camera_status_label = NULL;
    }
    lvgl_port_unlock();
    if (s_camera_display_buf != NULL) {
        heap_caps_free(s_camera_display_buf);
        s_camera_display_buf = NULL;
    }
    s_camera_save_requested = false;
    if (icon_flag == 4) {
        icon_flag = 0;
    }
    s_camera_running = false;
    s_camera_task_handle = NULL;
    vTaskDelete(NULL);
}

// 返回主界面按钮事件处理函数
static void btn_camback_cb(lv_event_t * e)
{
    if (icon_flag == 4) {
        camera_set_status("关闭中...");
        icon_flag = 0;
    }
}

static void btn_camera_save_cb(lv_event_t * e)
{
    s_camera_save_requested = true;
    camera_set_status("准备拍照...");
}

// 进入摄像头应用
static void camera_event_handler(lv_event_t * e)
{
    if (s_camera_running || s_camera_task_handle != NULL) {
        ESP_LOGW(TAG, "camera is still stopping");
        return;
    }

    // 创建一个界面对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);  
    lv_style_set_bg_opa( &style, LV_OPA_COVER );
    lv_style_set_bg_color(&style, lv_color_hex(0xcccccc));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);  
    lv_style_set_height(&style, 240); 

    icon_in_obj = lv_obj_create(lv_scr_act());
    s_camera_page = icon_in_obj;
    lv_obj_add_style(icon_in_obj, &style, 0);

    img_camera = lv_img_create(icon_in_obj);
    lv_obj_set_pos(img_camera, 0, 0);
    lv_obj_set_size(img_camera, 320, 240);

    // 创建返回按钮
    lv_obj_t *btn_back = lv_btn_create(icon_in_obj);
    lv_obj_align(btn_back, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_size(btn_back, 60, 30);
    lv_obj_set_style_border_width(btn_back, 0, 0); // 设置边框宽度
    lv_obj_set_style_pad_all(btn_back, 0, 0);  // 设置间隙
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 背景透明
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 阴影透明
    lv_obj_add_event_cb(btn_back, btn_camback_cb, LV_EVENT_CLICKED, NULL); // 添加按键处理函数

    lv_obj_t *label_back = lv_label_create(btn_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    lv_obj_t *btn_save = lv_btn_create(icon_in_obj);
    lv_obj_align(btn_save, LV_ALIGN_TOP_RIGHT, 0, 0);
    lv_obj_set_size(btn_save, 60, 30);
    lv_obj_set_style_border_width(btn_save, 0, 0);
    lv_obj_set_style_pad_all(btn_save, 0, 0);
    lv_obj_set_style_bg_opa(btn_save, LV_OPA_50, LV_PART_MAIN);
    lv_obj_set_style_shadow_opa(btn_save, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_add_event_cb(btn_save, btn_camera_save_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label_save = lv_label_create(btn_save);
    lv_label_set_text(label_save, LV_SYMBOL_SAVE);
    lv_obj_set_style_text_font(label_save, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_save, lv_color_hex(0xffffff), 0);
    lv_obj_center(label_save);

    camera_status_label = lv_label_create(icon_in_obj);
    lv_label_set_text(camera_status_label, "Ready");
    lv_obj_set_style_text_font(camera_status_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(camera_status_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_bg_color(camera_status_label, lv_color_hex(0x000000), 0);
    lv_obj_set_style_bg_opa(camera_status_label, LV_OPA_50, 0);
    lv_obj_set_style_pad_left(camera_status_label, 8, 0);
    lv_obj_set_style_pad_right(camera_status_label, 8, 0);
    lv_obj_set_style_pad_top(camera_status_label, 3, 0);
    lv_obj_set_style_pad_bottom(camera_status_label, 3, 0);
    lv_obj_align(camera_status_label, LV_ALIGN_BOTTOM_MID, 0, -6);

    icon_flag = 4; // 标记已经进入第四个应用

    s_camera_running = true;
    if (xTaskCreatePinnedToCore(task_process_camera, "task_process_camera", 4 * 1024,
                                s_camera_page, 5, &s_camera_task_handle, 1) != pdPASS) {
        s_camera_running = false;
        s_camera_task_handle = NULL;
        camera_set_status("任务创建失败");
    }
}


/******************************** 第5个图标 WiFi设置 应用程序*****************************************************************************/

lv_obj_t *wifi_scan_page;     // wifi扫描页面 obj
lv_obj_t *wifi_password_page; // wifi密码页面 obj
lv_obj_t *wifi_connect_page;  // wifi连接页面 obj
lv_obj_t *obj_scan_title;     // wifi扫描页面标题
lv_obj_t *label_wifi_scan;    // wif扫描页面 label
lv_obj_t *wifi_list;          // wifi列表  list
lv_obj_t *label_wifi_connect; // wifi连接页面label 
lv_obj_t *ta_pass_text;       // 密码输入文本框 textarea
lv_obj_t *roller_num;         // 数字roller
lv_obj_t *roller_letter_low;  // 小写字母roller
lv_obj_t *roller_letter_up;   // 大写字母roller
lv_obj_t *label_wifi_name;    // wifi名称label


#define DEFAULT_SCAN_LIST_SIZE   5                // 最大扫描wifi个数

// wifi事件组
static EventGroupHandle_t s_wifi_event_group = NULL;
// wifi事件
#define WIFI_CONNECTED_BIT    BIT0
#define WIFI_FAIL_BIT         BIT1
#define WIFI_START_BIT        BIT2
#define WIFI_GET_SNTP_BIT     BIT3
// wifi最大重连次数
#define EXAMPLE_ESP_MAXIMUM_RETRY  3

// wifi账号队列
static QueueHandle_t xQueueWifiAccount = NULL;
// 队列要传输的内容
typedef struct {
    char wifi_ssid[32];  // 获取wifi名称
    char wifi_password[64]; // 获取wifi密码  
    wifi_auth_mode_t authmode;
    char back_flag; // 是否退出       
} wifi_account_t;

#define WIFI_HISTORY_MAX 10
#define WIFI_HISTORY_PATH SD_MOUNT_POINT "/szpi/config/wlan_history.ini"
#define RANDOM_WIFI_CONFIG_PATH SD_MOUNT_POINT "/szpi/config/wifi.ini"
#define WIFI_NVS_NAMESPACE "szpi_wifi"
#define WIFI_NVS_HISTORY_KEY "history"
#define WIFI_NVS_COUNT_KEY "count"

