xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
typedef struct {
    char ssid[33];
    char password[65];
    wifi_auth_mode_t authmode;
} wifi_saved_network_t;

static wifi_saved_network_t s_wifi_history[WIFI_HISTORY_MAX];
static size_t s_wifi_history_count;
static bool s_wifi_history_loaded;
static wifi_ap_record_t s_wifi_ap_records[DEFAULT_SCAN_LIST_SIZE];
static uint16_t s_wifi_ap_count;
static bool s_wifi_handlers_registered;
static bool s_wifi_driver_started;
static bool s_wifi_autoconnect_started;
static bool s_time_sync_started;
static lv_timer_t *s_time_update_timer;
static int s_wifi_retry_num;

static char *wifi_trim(char *text)
{
    if (text == NULL) {
        return NULL;
    }

    while (*text != '\0' && isspace((unsigned char)*text)) {
        text++;
    }

    char *end = text + strlen(text);
    while (end > text && isspace((unsigned char)end[-1])) {
        *--end = '\0';
    }
    return text;
}

static void wifi_config_set_credentials(wifi_config_t *config, const char *ssid, const char *password)
{
    if (config == NULL) {
        return;
    }

    const char *safe_ssid = ssid ? ssid : "";
    const char *safe_password = password ? password : "";
    size_t ssid_len = strnlen(safe_ssid, sizeof(config->sta.ssid));
    size_t password_len = strnlen(safe_password, sizeof(config->sta.password) - 1);

    memset(config->sta.ssid, 0, sizeof(config->sta.ssid));
    memset(config->sta.password, 0, sizeof(config->sta.password));
    memcpy(config->sta.ssid, safe_ssid, ssid_len);
    memcpy(config->sta.password, safe_password, password_len);
    config->sta.threshold.authmode = password_len == 0 ? WIFI_AUTH_OPEN : WIFI_AUTH_WPA_PSK;
}

static void wifi_history_upsert(const char *ssid, const char *password, wifi_auth_mode_t authmode)
{
    if (ssid == NULL || ssid[0] == '\0') {
        return;
    }

    for (size_t i = 0; i < s_wifi_history_count; i++) {
        if (strcmp(s_wifi_history[i].ssid, ssid) == 0) {
            wifi_saved_network_t entry = s_wifi_history[i];
            snprintf(entry.password, sizeof(entry.password), "%s", password ? password : "");
            entry.authmode = authmode;
            if (i + 1 < s_wifi_history_count) {
                memmove(&s_wifi_history[i], &s_wifi_history[i + 1],
                        sizeof(s_wifi_history[0]) * (s_wifi_history_count - i - 1));
                s_wifi_history[s_wifi_history_count - 1] = entry;
            } else {
                s_wifi_history[i] = entry;
            }
            return;
        }
    }

    if (s_wifi_history_count >= WIFI_HISTORY_MAX) {
        memmove(&s_wifi_history[0], &s_wifi_history[1], sizeof(s_wifi_history[0]) * (WIFI_HISTORY_MAX - 1));
        s_wifi_history_count = WIFI_HISTORY_MAX - 1;
    }

    snprintf(s_wifi_history[s_wifi_history_count].ssid, sizeof(s_wifi_history[s_wifi_history_count].ssid), "%s", ssid);
    snprintf(s_wifi_history[s_wifi_history_count].password, sizeof(s_wifi_history[s_wifi_history_count].password), "%s", password ? password : "");
    s_wifi_history[s_wifi_history_count].authmode = authmode;
    s_wifi_history_count++;
}

static const wifi_saved_network_t *wifi_history_find(const char *ssid)
{
    if (ssid == NULL) {
        return NULL;
    }

    for (size_t i = 0; i < s_wifi_history_count; i++) {
        if (strcmp(s_wifi_history[i].ssid, ssid) == 0) {
            return &s_wifi_history[i];
        }
    }
    return NULL;
}

static void wifi_history_commit_entry(char *ssid, char *password, wifi_auth_mode_t authmode)
{
    if (ssid[0] != '\0') {
        wifi_history_upsert(ssid, password, authmode);
    }
    ssid[0] = '\0';
    password[0] = '\0';
}

static void wifi_history_load_nvs(void)
{
    nvs_handle_t nvs;
    esp_err_t ret = nvs_open(WIFI_NVS_NAMESPACE, NVS_READONLY, &nvs);
    if (ret != ESP_OK) {
        return;
    }

    uint32_t count = 0;
    size_t blob_size = sizeof(s_wifi_history);
    if (nvs_get_u32(nvs, WIFI_NVS_COUNT_KEY, &count) == ESP_OK &&
        nvs_get_blob(nvs, WIFI_NVS_HISTORY_KEY, s_wifi_history, &blob_size) == ESP_OK) {
        size_t max_count = blob_size / sizeof(s_wifi_history[0]);
        if (count > WIFI_HISTORY_MAX) {
            count = WIFI_HISTORY_MAX;
        }
        if (count > max_count) {
            count = max_count;
        }
        s_wifi_history_count = count;
    }
    nvs_close(nvs);
}

static void wifi_history_save_nvs(void)
{
    nvs_handle_t nvs;
    esp_err_t ret = nvs_open(WIFI_NVS_NAMESPACE, NVS_READWRITE, &nvs);
    if (ret != ESP_OK) {
        return;
    }

    nvs_set_u32(nvs, WIFI_NVS_COUNT_KEY, (uint32_t)s_wifi_history_count);
    nvs_set_blob(nvs, WIFI_NVS_HISTORY_KEY, s_wifi_history,
                 sizeof(s_wifi_history[0]) * s_wifi_history_count);
    nvs_commit(nvs);
    nvs_close(nvs);
}

static void wifi_history_load(void)
{
    if (s_wifi_history_loaded) {
        return;
    }

    s_wifi_history_loaded = true;
    s_wifi_history_count = 0;
    wifi_history_load_nvs();

    if (bsp_sdcard_mount() != ESP_OK) {
        return;
    }

    FILE *f = fopen(WIFI_HISTORY_PATH, "r");
    if (f == NULL) {
        return;
    }

    char line[160];
    char ssid[33] = {0};
    char password[65] = {0};
    wifi_auth_mode_t authmode = WIFI_AUTH_WPA2_PSK;

    while (fgets(line, sizeof(line), f) != NULL) {
        char *text = wifi_trim(line);
        if (text[0] == '\0' || text[0] == '#') {
            continue;
        }
        if (strcmp(text, "[network]") == 0) {
            wifi_history_commit_entry(ssid, password, authmode);
            authmode = WIFI_AUTH_WPA2_PSK;
            continue;
        }

        char *eq = strchr(text, '=');
        if (eq == NULL) {
            continue;
        }
        *eq = '\0';
        char *key = wifi_trim(text);
        char *value = wifi_trim(eq + 1);
        if (strcmp(key, "ssid") == 0) {
            snprintf(ssid, sizeof(ssid), "%s", value);
        } else if (strcmp(key, "password") == 0) {
            snprintf(password, sizeof(password), "%s", value);
        } else if (strcmp(key, "auth") == 0) {
            authmode = (wifi_auth_mode_t)atoi(value);
        }
    }

    wifi_history_commit_entry(ssid, password, authmode);
    fclose(f);
}

static void wifi_history_save_all(void)
{
    wifi_history_save_nvs();

    if (bsp_sdcard_mount() != ESP_OK) {
        return;
    }

