xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/config", 0775);

    FILE *f = fopen(WIFI_HISTORY_PATH, "w");
    if (f == NULL) {
        return;
    }

    fprintf(f, "# SZPI WLAN history\n");
    for (size_t i = 0; i < s_wifi_history_count; i++) {
        fprintf(f, "[network]\nssid=%s\npassword=%s\nauth=%d\n",
                s_wifi_history[i].ssid,
                s_wifi_history[i].password,
                (int)s_wifi_history[i].authmode);
    }
    fclose(f);
}

static void wifi_save_random_image_config(const char *ssid, const char *password)
{
    if (bsp_sdcard_mount() != ESP_OK) {
        return;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/config", 0775);

    FILE *f = fopen(RANDOM_WIFI_CONFIG_PATH, "w");
    if (f == NULL) {
        return;
    }
    fprintf(f,
            "# Used by random image app. Edit on your computer if needed.\n"
            "ssid=%s\n"
            "password=%s\n"
            "api_url=%s\n",
            ssid ? ssid : "",
            password ? password : "",
            CONFIG_RANDOM_IMAGE_API_URL);
    fclose(f);
}

static wifi_auth_mode_t wifi_find_authmode(const char *ssid)
{
    if (ssid == NULL) {
        return WIFI_AUTH_WPA2_PSK;
    }

    for (uint16_t i = 0; i < s_wifi_ap_count; i++) {
        if (strcmp((const char *)s_wifi_ap_records[i].ssid, ssid) == 0) {
            return s_wifi_ap_records[i].authmode;
        }
    }
    return WIFI_AUTH_WPA2_PSK;
}

static bool wifi_auth_is_open(wifi_auth_mode_t authmode)
{
    return authmode == WIFI_AUTH_OPEN;
}

// 密码roller的遮罩显示效果
static void mask_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t * obj = lv_event_get_target(e);

    static int16_t mask_top_id = -1;
    static int16_t mask_bottom_id = -1;

    if(code == LV_EVENT_COVER_CHECK) {
        lv_event_set_cover_res(e, LV_COVER_RES_MASKED);
    }
    else if(code == LV_EVENT_DRAW_MAIN_BEGIN) {
        /* add mask */
        const lv_font_t * font = lv_obj_get_style_text_font(obj, LV_PART_MAIN);
        lv_coord_t line_space = lv_obj_get_style_text_line_space(obj, LV_PART_MAIN);
        lv_coord_t font_h = lv_font_get_line_height(font);

        lv_area_t roller_coords;
        lv_obj_get_coords(obj, &roller_coords);

        lv_area_t rect_area;
        rect_area.x1 = roller_coords.x1;
        rect_area.x2 = roller_coords.x2;
        rect_area.y1 = roller_coords.y1;
        rect_area.y2 = roller_coords.y1 + (lv_obj_get_height(obj) - font_h - line_space) / 2;

        lv_draw_mask_fade_param_t * fade_mask_top = lv_mem_buf_get(sizeof(lv_draw_mask_fade_param_t));
        lv_draw_mask_fade_init(fade_mask_top, &rect_area, LV_OPA_TRANSP, rect_area.y1, LV_OPA_COVER, rect_area.y2);
        mask_top_id = lv_draw_mask_add(fade_mask_top, NULL);

        rect_area.y1 = rect_area.y2 + font_h + line_space - 1;
        rect_area.y2 = roller_coords.y2;

        lv_draw_mask_fade_param_t * fade_mask_bottom = lv_mem_buf_get(sizeof(lv_draw_mask_fade_param_t));
        lv_draw_mask_fade_init(fade_mask_bottom, &rect_area, LV_OPA_COVER, rect_area.y1, LV_OPA_TRANSP, rect_area.y2);
        mask_bottom_id = lv_draw_mask_add(fade_mask_bottom, NULL);

    }
    else if(code == LV_EVENT_DRAW_POST_END) {
        lv_draw_mask_fade_param_t * fade_mask_top = lv_draw_mask_remove_id(mask_top_id);
        lv_draw_mask_fade_param_t * fade_mask_bottom = lv_draw_mask_remove_id(mask_bottom_id);
        lv_draw_mask_free_param(fade_mask_top);
        lv_draw_mask_free_param(fade_mask_bottom);
        lv_mem_buf_release(fade_mask_top);
        lv_mem_buf_release(fade_mask_bottom);
        mask_top_id = -1;
        mask_bottom_id = -1;
    }
}

// 数字键 处理函数
static void btn_num_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        ESP_LOGI(TAG, "Btn-Num Clicked");
        char buf[2]; // 接收roller的值
        lv_roller_get_selected_str(roller_num, buf, sizeof(buf));
        lv_textarea_add_text(ta_pass_text, buf);
    }
}

// 小写字母确认键 处理函数
static void btn_letter_low_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        ESP_LOGI(TAG, "Btn-Letter-Low Clicked");
        char buf[2]; // 接收roller的值
        lv_roller_get_selected_str(roller_letter_low, buf, sizeof(buf));
        lv_textarea_add_text(ta_pass_text, buf);
    }
}

// 大写字母确认键 处理函数
static void btn_letter_up_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        ESP_LOGI(TAG, "Btn-Letter-Up Clicked");
        char buf[2]; // 接收roller的值
        lv_roller_get_selected_str(roller_letter_up, buf, sizeof(buf));
        lv_textarea_add_text(ta_pass_text, buf);
    }
}

static void lv_wifi_connect(void)
{
    if (wifi_password_page != NULL) {
        lv_obj_del(wifi_password_page); // 删除密码输入界面
        wifi_password_page = NULL;
    }

    // 创建一个面板对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_bg_opa( &style, LV_OPA_COVER );
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_radius(&style, 0);  
    lv_style_set_width(&style, 320);  
    lv_style_set_height(&style, 240); 

    wifi_connect_page = lv_obj_create(lv_scr_act());
    lv_obj_add_style(wifi_connect_page, &style, 0);

    // 绘制label提示
    label_wifi_connect = lv_label_create(wifi_connect_page);
    lv_label_set_text(label_wifi_connect, "WLAN连接中...");
    lv_obj_set_style_text_font(label_wifi_connect, &font_alipuhui20, 0);
    lv_obj_align(label_wifi_connect, LV_ALIGN_CENTER, 0, -50);
}

static void wifi_begin_connect(const char *ssid, const char *password, wifi_auth_mode_t authmode)
{
    if (ssid == NULL || ssid[0] == '\0' || xQueueWifiAccount == NULL) {
        return;
    }

    wifi_account_t wifi_account = {0};
    snprintf(wifi_account.wifi_ssid, sizeof(wifi_account.wifi_ssid), "%s", ssid);
    snprintf(wifi_account.wifi_password, sizeof(wifi_account.wifi_password), "%s", password ? password : "");
    wifi_account.authmode = authmode;
    wifi_account.back_flag = 0;

    ESP_LOGI(TAG, "connect request SSID:%s auth:%d saved:%s",
             wifi_account.wifi_ssid,
             (int)wifi_account.authmode,
             wifi_account.wifi_password[0] ? "yes" : "empty");
    lv_wifi_connect(); // 显示wifi连接界面
    xQueueSend(xQueueWifiAccount, &wifi_account, portMAX_DELAY);
}

// WiFi连接按钮 处理函数
static void btn_connect_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

