xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        ret = esp_wifi_init(&cfg);
        if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
            return ret;
        }
        (void)esp_wifi_set_storage(WIFI_STORAGE_FLASH);
    }

    if (!s_wifi_handlers_registered) {
        ret = esp_event_handler_instance_register(WIFI_EVENT,
                                                  ESP_EVENT_ANY_ID,
                                                  &event_handler,
                                                  NULL,
                                                  &instance_any_id);
        if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
            return ret;
        }

        ret = esp_event_handler_instance_register(IP_EVENT,
                                                  IP_EVENT_STA_GOT_IP,
                                                  &event_handler,
                                                  NULL,
                                                  &instance_got_ip);
        if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
            return ret;
        }
        s_wifi_handlers_registered = true;
    }

    ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK) {
        return ret;
    }

    ret = esp_wifi_start();
    if (ret != ESP_OK && ret != ESP_ERR_WIFI_CONN) {
        return ret;
    }
    s_wifi_driver_started = true;
    return ESP_OK;
}

static void wifi_autoconnect_task(void *arg)
{
    vTaskDelay(pdMS_TO_TICKS(800));
    wifi_history_load();
    if (s_wifi_history_count == 0) {
        ESP_LOGI(TAG, "no saved WLAN for autoconnect");
        s_wifi_autoconnect_started = false;
        vTaskDelete(NULL);
        return;
    }

    const wifi_saved_network_t *saved = &s_wifi_history[s_wifi_history_count - 1];
    if (saved->ssid[0] == '\0') {
        s_wifi_autoconnect_started = false;
        vTaskDelete(NULL);
        return;
    }

    esp_err_t ret = wifi_ensure_sta_started();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WLAN autoconnect start failed: %s", esp_err_to_name(ret));
        s_wifi_autoconnect_started = false;
        vTaskDelete(NULL);
        return;
    }

    wifi_config_t wifi_config = {
        .sta = {
            .sae_pwe_h2e = WPA3_SAE_PWE_BOTH,
            .sae_h2e_identifier = "",
        },
    };
    wifi_config_set_credentials(&wifi_config, saved->ssid, saved->password);

    xEventGroupClearBits(s_wifi_event_group, WIFI_CONNECTED_BIT | WIFI_FAIL_BIT);
    s_wifi_retry_num = 0;
    ret = esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "WLAN autoconnect SSID:%s", saved->ssid);
        (void)esp_wifi_disconnect();
        ret = esp_wifi_connect();
    }
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WLAN autoconnect failed: %s", esp_err_to_name(ret));
        s_wifi_autoconnect_started = false;
        vTaskDelete(NULL);
        return;
    }

    EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
                                           WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
                                           pdFALSE,
                                           pdFALSE,
                                           pdMS_TO_TICKS(20000));
    if (bits & WIFI_CONNECTED_BIT) {
        ESP_LOGI(TAG, "WLAN autoconnect connected: %s", saved->ssid);
    } else {
        ESP_LOGW(TAG, "WLAN autoconnect did not connect: %s", saved->ssid);
        xEventGroupClearBits(s_wifi_event_group, WIFI_FAIL_BIT);
        s_wifi_autoconnect_started = false;
    }
    vTaskDelete(NULL);
}

static void wifi_start_autoconnect(void)
{
    if (s_wifi_autoconnect_started) {
        return;
    }
    s_wifi_autoconnect_started = true;
    BaseType_t ok = xTaskCreatePinnedToCore(wifi_autoconnect_task, "wifi_auto", 5 * 1024, NULL, 4, NULL, 0);
    if (ok != pdPASS) {
        s_wifi_autoconnect_started = false;
        ESP_LOGE(TAG, "create wifi_auto task failed");
    }
}

// 扫描附近wifi
static esp_err_t wifi_scan(wifi_ap_record_t ap_info[], uint16_t *ap_number)
{
    uint16_t ap_count = 0;
    esp_err_t ret = wifi_ensure_sta_started();
    if (ret != ESP_OK) {
        return ret;
    }

    memset(ap_info, 0, *ap_number * sizeof(wifi_ap_record_t));

    ret = esp_wifi_scan_start(NULL, true);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "wifi scan failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ESP_LOGI(TAG, "Max AP number ap_info can hold = %u", *ap_number);
    ESP_RETURN_ON_ERROR(esp_wifi_scan_get_ap_num(&ap_count), TAG, "get AP num failed");  // 获取扫描到的wifi数量
    ESP_RETURN_ON_ERROR(esp_wifi_scan_get_ap_records(ap_number, ap_info), TAG, "get AP records failed"); // 获取真实的获取到wifi数量和信息
    ESP_LOGI(TAG, "Total APs scanned = %u, actual AP number ap_info holds = %u", ap_count, *ap_number);
    return ESP_OK;
}

// 清除wifi初始化内容
static void wifiset_deinit(void)
{
    // WiFi may be shared with random image and time sync. Keep the driver alive.
}

// WIFI连接任务
static void wifi_connect(void *arg)
{
    wifi_account_t wifi_account;

    while (true)
    {
        // 如果收到wifi账号队列消息
        if(xQueueReceive(xQueueWifiAccount, &wifi_account, portMAX_DELAY))
        {
            if (wifi_account.back_flag == 1){  // 退出任务标志
                if (xQueueWifiAccount != NULL) {
                    vQueueDelete(xQueueWifiAccount);
                    xQueueWifiAccount = NULL;
                }
                break; // 跳出while循环
            }
            
            wifi_config_t wifi_config = {
                .sta = {
                    .sae_pwe_h2e = WPA3_SAE_PWE_BOTH,
                    .sae_h2e_identifier = "",
                    },
            };
            wifi_config_set_credentials(&wifi_config, wifi_account.wifi_ssid, wifi_account.wifi_password);

            esp_err_t ret = wifi_ensure_sta_started();
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "wifi start failed: %s", esp_err_to_name(ret));
                if (label_wifi_connect != NULL) {
                    lvgl_port_lock(0);
                    lv_label_set_text(label_wifi_connect, "WLAN 启动失败");
                    lvgl_port_unlock();
                }
                vTaskDelay(pdMS_TO_TICKS(1000));
                if (wifi_connect_page != NULL) {
                    lvgl_port_lock(0);
                    lv_obj_del(wifi_connect_page);
                    wifi_connect_page = NULL;
                    lvgl_port_unlock();
                }
                continue;
            }

