xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
            xEventGroupClearBits(s_wifi_event_group, WIFI_CONNECTED_BIT | WIFI_FAIL_BIT);
            s_wifi_retry_num = 0;
            ret = esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "wifi config failed: %s", esp_err_to_name(ret));
                if (label_wifi_connect != NULL) {
                    lvgl_port_lock(0);
                    lv_label_set_text(label_wifi_connect, "WLAN 配置失败");
                    lvgl_port_unlock();
                }
                vTaskDelay(pdMS_TO_TICKS(1000));
                if (wifi_connect_page != NULL) {
                    lvgl_port_lock(0);
                    lv_obj_del(wifi_connect_page);
                    wifi_connect_page = NULL;
                    lvgl_port_unlock();
                }
                continue;
            }
            esp_wifi_disconnect();
            esp_wifi_connect();
            /* Waiting until either the connection is established (WIFI_CONNECTED_BIT) or connection failed for the maximum
            * number of re-tries (WIFI_FAIL_BIT). The bits are set by event_handler() (see above) */
            EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
            WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
            pdFALSE,
            pdFALSE,
            pdMS_TO_TICKS(20000));

            /* xEventGroupWaitBits() returns the bits before the call returned, hence we can test which event actually
            * happened. */
            if (bits & WIFI_CONNECTED_BIT) {
                ESP_LOGI(TAG, "connected to ap SSID:%s password:%s", wifi_config.sta.ssid, wifi_config.sta.password);
                wifi_history_upsert(wifi_account.wifi_ssid, wifi_account.wifi_password, wifi_account.authmode);
                wifi_history_save_all();
                wifi_save_random_image_config(wifi_account.wifi_ssid, wifi_account.wifi_password);
                lvgl_port_lock(0);
                lv_label_set_text(label_wifi_connect, "WLAN 连接成功");
                lvgl_port_unlock();
                vTaskDelay(1000 / portTICK_PERIOD_MS); // 给上面的显示一点时间
                lvgl_port_lock(0);
                lv_obj_del(wifi_connect_page); // 删除此页面
                wifi_connect_page = NULL;
                lv_obj_del(wifi_scan_page); // 删除此页面
                wifi_scan_page = NULL;
                lvgl_port_unlock();
                vQueueDelete(xQueueWifiAccount); // 删除队列
                xQueueWifiAccount = NULL;
                icon_flag = 0; // 标记回到主界面
                break; // 跳出while循环删除任务
            } else if (bits & WIFI_FAIL_BIT) {
                ESP_LOGI(TAG, "Failed to connect to SSID:%s, password:%s", wifi_config.sta.ssid, wifi_config.sta.password);
                lvgl_port_lock(0);
                lv_label_set_text(label_wifi_connect, "WLAN 连接失败");
                lvgl_port_unlock();
                vTaskDelay(1000 / portTICK_PERIOD_MS); // 给上面的显示一点时间
                lvgl_port_lock(0);
                lv_obj_del(wifi_connect_page); // 删除此页面
                wifi_connect_page = NULL;
                lvgl_port_unlock();
                xEventGroupClearBits(s_wifi_event_group, WIFI_FAIL_BIT); // 清除此事件标志位

            } else {
                ESP_LOGE(TAG, "UNEXPECTED EVENT");
                lvgl_port_lock(0);
                lv_label_set_text(label_wifi_connect, "WLAN 连接异常");
                lvgl_port_unlock();
                vTaskDelay(1000 / portTICK_PERIOD_MS); // 给上面的显示一点时间
                lvgl_port_lock(0);
                lv_obj_del(wifi_connect_page); // 删除此页面
                wifi_connect_page = NULL;
                lv_obj_del(wifi_scan_page); // 删除此页面
                wifi_scan_page = NULL;
                lvgl_port_unlock();
            }
        }
    }
    vTaskDelete(NULL);
}

// 返回主界面按钮事件处理函数
static void btn_backmain_cb(lv_event_t * e)
{
    ESP_LOGI(TAG, "btn_backmain Clicked");

    // // 删除wifi扫描界面
    lvgl_port_lock(0);
    if (wifi_scan_page != NULL) {
        lv_obj_del(wifi_scan_page);
        wifi_scan_page = NULL;
    }
    lvgl_port_unlock();

    // 通知wifi_connect任务退出
    if (xQueueWifiAccount != NULL) {
        wifi_account_t wifi_account = {0};
        wifi_account.back_flag = 1;
        xQueueSend(xQueueWifiAccount, &wifi_account, pdMS_TO_TICKS(100));
    }
    
    wifiset_deinit();// 保留WiFi连接，仅清理WLAN页面状态
    icon_flag = 0;
}

// wifi连接
void app_wifi_connect(void *arg)
{
    vTaskDelay(200 / portTICK_PERIOD_MS);
    // 扫描WLAN信息
    uint16_t ap_number = DEFAULT_SCAN_LIST_SIZE;
    wifi_history_load();
    esp_err_t scan_ret = wifi_scan(s_wifi_ap_records, &ap_number); // 扫描附近wifi
    if (scan_ret != ESP_OK) {
        lvgl_port_lock(0);
        lv_label_set_text_fmt(label_wifi_scan, "WLAN扫描失败\n%s", esp_err_to_name(scan_ret));
        lvgl_port_unlock();
        vTaskDelay(pdMS_TO_TICKS(1200));
        lvgl_port_lock(0);
        if (wifi_scan_page != NULL) {
            lv_obj_del(wifi_scan_page);
            wifi_scan_page = NULL;
        }
        lvgl_port_unlock();
        icon_flag = 0;
        vTaskDelete(NULL);
        return;
    }
    s_wifi_ap_count = ap_number;

    lvgl_port_lock(0);
    // 修改标题
    lv_label_set_text_fmt(label_wifi_scan, "%d WLAN", ap_number);

    // 创建返回按钮
    lv_obj_t *btn_back = lv_btn_create(obj_scan_title);
    lv_obj_align(btn_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_back, 60, 30);
    lv_obj_set_style_border_width(btn_back, 0, 0); // 设置边框宽度
    lv_obj_set_style_pad_all(btn_back, 0, 0);  // 设置间隙
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 背景透明
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 阴影透明
    lv_obj_add_event_cb(btn_back, btn_backmain_cb, LV_EVENT_CLICKED, NULL); // 添加按键处理函数

    lv_obj_t *label_back = lv_label_create(btn_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

