xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    // 创建wifi信息列表
    wifi_list = lv_list_create(wifi_scan_page);
    lv_obj_set_size(wifi_list, 320, 200);
    lv_obj_align(wifi_list, LV_ALIGN_TOP_LEFT, 0, 40);
    lv_obj_set_style_border_width(wifi_list, 0, 0);
    lv_obj_set_style_text_font(wifi_list, &font_alipuhui20, 0);
    lv_obj_set_scrollbar_mode(wifi_list, LV_SCROLLBAR_MODE_OFF); // 隐藏wifi_list滚动条
    // 显示wifi信息
    lv_obj_t * btn;
    for (int i = 0; i < ap_number; i++) {
        ESP_LOGI(TAG, "SSID \t\t%s", s_wifi_ap_records[i].ssid);  // 终端输出wifi名称
        ESP_LOGI(TAG, "RSSI \t\t%d", s_wifi_ap_records[i].rssi);  // 终端输出wifi信号质量
        // 添加wifi列表
        btn = lv_list_add_btn(wifi_list, LV_SYMBOL_WIFI, (const char *)s_wifi_ap_records[i].ssid);
        lv_obj_add_event_cb(btn, list_btn_cb, LV_EVENT_CLICKED, NULL); // 添加点击回调函数
    }
    lvgl_port_unlock();
    
    // 创建wifi连接任务
    xQueueWifiAccount = xQueueCreate(2, sizeof(wifi_account_t));
    xTaskCreatePinnedToCore(wifi_connect, "wifi_connect", 4 * 1024, NULL, 5, NULL, 1);  // 创建wifi连接任务
    vTaskDelete(NULL);
}

// 进入WIFI设置应用
static void wifiset_event_handler(lv_event_t * e)
{  
    // 创建一个界面对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);  
    lv_style_set_bg_opa( &style, LV_OPA_COVER );
    lv_style_set_bg_color(&style, lv_color_hex(0xFFFFFF));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);  
    lv_style_set_height(&style, 240); 

    wifi_scan_page = lv_obj_create(lv_scr_act());
    lv_obj_add_style(wifi_scan_page, &style, 0);

    // 创建标题背景
    obj_scan_title = lv_obj_create(wifi_scan_page);
    lv_obj_set_size(obj_scan_title, 320, 40);
    lv_obj_set_style_pad_all(obj_scan_title, 0, 0);  // 设置间隙
    lv_obj_align(obj_scan_title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(obj_scan_title, lv_color_hex(0x008b8b), 0);
    // 显示扫描情况
    label_wifi_scan = lv_label_create(obj_scan_title);
    lv_label_set_text(label_wifi_scan, "WLAN扫描中...");
    lv_obj_set_style_text_color(label_wifi_scan, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_text_font(label_wifi_scan, &font_alipuhui20, 0);
    lv_obj_align(label_wifi_scan, LV_ALIGN_CENTER, 0, 0);

    icon_flag = 5; // 标记已经进入第5个应用

    xTaskCreatePinnedToCore(app_wifi_connect, "app_wifi_connect", 4*1024, NULL, 5, NULL, 0);
}


/******************************** 第6个图标 蓝牙设置 应用程序***********************************************************************************/
lv_obj_t * ble_label;
lv_obj_t * btn_ble_back;

// 返回主界面按钮事件处理函数
static void btn_ble_back_cb(lv_event_t * e)
{
    bt_hid_end();
    if (icon_in_obj != NULL) {
        lv_obj_del(icon_in_obj);
        icon_in_obj = NULL;
    }
    icon_flag = 0;
}

// 进入蓝牙设置应用
static void btset_event_handler(lv_event_t * e)
{
    // 创建一个界面对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);  
    lv_style_set_bg_opa( &style, LV_OPA_COVER );
    lv_style_set_bg_color(&style, lv_color_hex(0xffffff));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);  
    lv_style_set_height(&style, 240); 

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);
    
    // 创建标题背景
    lv_obj_t *ble_title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(ble_title, 320, 40);
    lv_obj_set_style_pad_all(ble_title, 0, 0);  // 设置间隙
    lv_obj_align(ble_title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(ble_title, lv_color_hex(0xb87fa8), 0);
    // 显示标题
    ble_label = lv_label_create(ble_title);
    lv_label_set_text(ble_label, "蓝牙控制器");
    lv_obj_set_style_text_color(ble_label, lv_color_hex(0xffffff), 0); 
    lv_obj_set_style_text_font(ble_label, &font_alipuhui20, 0);
    lv_obj_align(ble_label, LV_ALIGN_CENTER, 0, 0);
    // 创建后退按钮
    btn_ble_back = lv_btn_create(ble_title);
    lv_obj_align(btn_ble_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_ble_back, 60, 30);
    lv_obj_set_style_border_width(btn_ble_back, 0, 0); // 设置边框宽度
    lv_obj_set_style_pad_all(btn_ble_back, 0, 0);  // 设置间隙
    lv_obj_set_style_bg_opa(btn_ble_back, LV_OPA_TRANSP, LV_PART_MAIN); // 背景透明
    lv_obj_set_style_shadow_opa(btn_ble_back, LV_OPA_TRANSP, LV_PART_MAIN); // 阴影透明
    lv_obj_add_event_cb(btn_ble_back, btn_ble_back_cb, LV_EVENT_CLICKED, NULL); // 添加按键处理函数

    lv_obj_t *label_back = lv_label_create(btn_ble_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    esp_err_t ret = app_hid_ctrl();
    if (ret == ESP_OK) {
        lv_label_set_text(ble_label, "BLE HID Ready");
    } else {
        lv_label_set_text_fmt(ble_label, "BLE失败:%s", esp_err_to_name(ret));
    }

    icon_flag = 6; // 标记已经进入第6个应用
}


/******************************** 录音机 应用程序 *****************************************************************************/
#define RECORDER_SAMPLE_RATE       16000
#define RECORDER_CHANNELS          1
#define RECORDER_BITS_PER_SAMPLE   16
#define RECORDER_SRC_CHANNELS      CODEC_DEFAULT_CHANNEL
#define RECORDER_FRAMES_PER_CHUNK  512
#define RECORDER_ICON_FLAG         8

static lv_obj_t *s_recorder_status_label;
static lv_obj_t *s_recorder_time_label;
static lv_obj_t *s_recorder_file_label;
static lv_obj_t *s_recorder_level_bar;
static lv_obj_t *s_recorder_button_label;
static TaskHandle_t s_recorder_task_handle;
static volatile bool s_recorder_active;
static volatile bool s_recorder_exit_requested;

static void recorder_write_le16(FILE *f, uint16_t value)
{
    uint8_t b[2] = {
        (uint8_t)(value & 0xff),
        (uint8_t)((value >> 8) & 0xff),
    };
    fwrite(b, 1, sizeof(b), f);
}

static void recorder_write_le32(FILE *f, uint32_t value)
{
    uint8_t b[4] = {
        (uint8_t)(value & 0xff),
        (uint8_t)((value >> 8) & 0xff),
        (uint8_t)((value >> 16) & 0xff),
        (uint8_t)((value >> 24) & 0xff),
    };
    fwrite(b, 1, sizeof(b), f);
}

static void recorder_write_wav_header(FILE *f, uint32_t data_bytes)
{
    uint32_t byte_rate = RECORDER_SAMPLE_RATE * RECORDER_CHANNELS * RECORDER_BITS_PER_SAMPLE / 8;
    uint16_t block_align = RECORDER_CHANNELS * RECORDER_BITS_PER_SAMPLE / 8;

    fwrite("RIFF", 1, 4, f);
    recorder_write_le32(f, 36 + data_bytes);
    fwrite("WAVE", 1, 4, f);
    fwrite("fmt ", 1, 4, f);
    recorder_write_le32(f, 16);
    recorder_write_le16(f, 1);
    recorder_write_le16(f, RECORDER_CHANNELS);
    recorder_write_le32(f, RECORDER_SAMPLE_RATE);
    recorder_write_le32(f, byte_rate);
    recorder_write_le16(f, block_align);
    recorder_write_le16(f, RECORDER_BITS_PER_SAMPLE);
    fwrite("data", 1, 4, f);
    recorder_write_le32(f, data_bytes);
}

static void recorder_set_label_text(lv_obj_t *label, const char *text)
{
    if (label == NULL) {
        return;
    }
    lvgl_port_lock(0);
    if (label != NULL) {
        lv_label_set_text(label, text);
    }
    lvgl_port_unlock();
}

static void recorder_update_ui(uint32_t samples_written, int peak)
{
    uint32_t seconds = samples_written / RECORDER_SAMPLE_RATE;
    char time_text[24];
    snprintf(time_text, sizeof(time_text), "%02lu:%02lu", (unsigned long)(seconds / 60), (unsigned long)(seconds % 60));

    lvgl_port_lock(0);
    if (s_recorder_time_label != NULL) {
        lv_label_set_text(s_recorder_time_label, time_text);
    }
    if (s_recorder_level_bar != NULL) {
        int value = peak * 100 / 32767;
        if (value > 100) {
            value = 100;
        }
        lv_bar_set_value(s_recorder_level_bar, value, LV_ANIM_OFF);
    }
    lvgl_port_unlock();
}

static void recorder_set_button_text(const char *text)
{
    recorder_set_label_text(s_recorder_button_label, text);
}

static void recorder_stop_and_exit_ui(void)
{
    lvgl_port_lock(0);
    if (icon_in_obj != NULL) {
        lv_obj_del(icon_in_obj);
        icon_in_obj = NULL;
    }
    lvgl_port_unlock();
    s_recorder_status_label = NULL;
    s_recorder_time_label = NULL;
    s_recorder_file_label = NULL;
    s_recorder_level_bar = NULL;
    s_recorder_button_label = NULL;
    icon_flag = 0;
}

static void recorder_task(void *arg)
{
    int16_t *raw = heap_caps_malloc(RECORDER_FRAMES_PER_CHUNK * RECORDER_SRC_CHANNELS * sizeof(int16_t), MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    int16_t *mono = heap_caps_malloc(RECORDER_FRAMES_PER_CHUNK * sizeof(int16_t), MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    FILE *f = NULL;
    uint32_t data_bytes = 0;
    uint32_t samples_written = 0;
    char path[128];
    esp_err_t ret = ESP_OK;

