xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    if (raw == NULL || mono == NULL) {
        recorder_set_label_text(s_recorder_status_label, "录音缓冲不足");
        goto done;
    }

    if (g_audio_player_ready) {
        audio_player_stop();
    }

    ret = bsp_codec_set_fs(RECORDER_SAMPLE_RATE, RECORDER_BITS_PER_SAMPLE, CODEC_DEFAULT_CHANNEL);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "recorder set fs failed: %s", esp_err_to_name(ret));
    }
    ESP_LOGI(TAG, "recorder fs=%dHz bits=%d src_ch=%d out_ch=%d",
             RECORDER_SAMPLE_RATE, RECORDER_BITS_PER_SAMPLE,
             RECORDER_SRC_CHANNELS, RECORDER_CHANNELS);

    ret = bsp_sdcard_mount();
    if (ret != ESP_OK) {
        recorder_set_label_text(s_recorder_status_label, "TF卡不可用");
        goto done;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/recordings", 0775);
    snprintf(path, sizeof(path), SD_MOUNT_POINT "/szpi/recordings/rec_%lld.wav", esp_timer_get_time() / 1000);

    f = fopen(path, "wb+");
    if (f == NULL) {
        recorder_set_label_text(s_recorder_status_label, "创建文件失败");
        goto done;
    }

    recorder_write_wav_header(f, 0);
    recorder_set_label_text(s_recorder_status_label, "录音中...");
    recorder_set_label_text(s_recorder_file_label, path);
    recorder_set_button_text("停止");

    while (s_recorder_active && icon_flag == RECORDER_ICON_FLAG) {
        ret = bsp_get_feed_data(true, raw, RECORDER_FRAMES_PER_CHUNK * RECORDER_SRC_CHANNELS * sizeof(int16_t));
        if (ret != ESP_OK) {
            recorder_set_label_text(s_recorder_status_label, "麦克风读取失败");
            break;
        }

        int peak = 0;
        for (int i = 0; i < RECORDER_FRAMES_PER_CHUNK; i++) {
            int16_t sample = raw[i * RECORDER_SRC_CHANNELS + 1];
            mono[i] = sample;
            int abs_sample = sample == INT16_MIN ? 32767 : abs(sample);
            if (abs_sample > peak) {
                peak = abs_sample;
            }
        }

        size_t written = fwrite(mono, sizeof(int16_t), RECORDER_FRAMES_PER_CHUNK, f);
        if (written != RECORDER_FRAMES_PER_CHUNK) {
            recorder_set_label_text(s_recorder_status_label, "写入失败");
            break;
        }

        data_bytes += RECORDER_FRAMES_PER_CHUNK * sizeof(int16_t);
        samples_written += RECORDER_FRAMES_PER_CHUNK;
        recorder_update_ui(samples_written, peak);
    }

    if (f != NULL) {
        fflush(f);
        fseek(f, 0, SEEK_SET);
        recorder_write_wav_header(f, data_bytes);
        fclose(f);
        f = NULL;
    }

    if (data_bytes > 0) {
        recorder_set_label_text(s_recorder_status_label, "已保存");
        recorder_set_label_text(s_recorder_file_label, path);
    }

done:
    if (f != NULL) {
        fclose(f);
    }
    if (raw != NULL) {
        heap_caps_free(raw);
    }
    if (mono != NULL) {
        heap_caps_free(mono);
    }
    s_recorder_active = false;
    s_recorder_task_handle = NULL;
    recorder_set_button_text("开始");
    if (s_recorder_exit_requested) {
        s_recorder_exit_requested = false;
        recorder_stop_and_exit_ui();
    }
    vTaskDelete(NULL);
}

static void recorder_toggle_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    if (s_recorder_active) {
        s_recorder_active = false;
        recorder_set_label_text(s_recorder_status_label, "停止中...");
        return;
    }

    if (s_recorder_task_handle != NULL) {
        return;
    }

    s_recorder_exit_requested = false;
    s_recorder_active = true;
    recorder_update_ui(0, 0);
    recorder_set_label_text(s_recorder_file_label, "");
    BaseType_t ok = xTaskCreatePinnedToCore(recorder_task, "recorder", 5 * 1024, NULL, 5, &s_recorder_task_handle, 1);
    if (ok != pdPASS) {
        s_recorder_active = false;
        s_recorder_task_handle = NULL;
        recorder_set_label_text(s_recorder_status_label, "启动失败");
    }
}

static void recorder_back_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    if (s_recorder_active) {
        s_recorder_exit_requested = true;
        s_recorder_active = false;
        recorder_set_label_text(s_recorder_status_label, "停止中...");
        return;
    }

    recorder_stop_and_exit_ui();
}

static void recorder_event_handler(lv_event_t *e)
{
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);
    lv_style_set_bg_opa(&style, LV_OPA_COVER);
    lv_style_set_bg_color(&style, lv_color_hex(0xffffff));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);
    lv_style_set_height(&style, 240);

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    lv_obj_t *title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(title, 320, 40);
    lv_obj_set_style_pad_all(title, 0, 0);
    lv_obj_align(title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(title, lv_color_hex(0x2c8dbf), 0);

    lv_obj_t *title_label = lv_label_create(title);
    lv_label_set_text(title_label, "录音机");
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_text_font(title_label, &font_alipuhui20, 0);
    lv_obj_align(title_label, LV_ALIGN_CENTER, 0, 0);

    lv_obj_t *btn_back = lv_btn_create(title);
    lv_obj_align(btn_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_back, 60, 30);
    lv_obj_set_style_border_width(btn_back, 0, 0);
    lv_obj_set_style_pad_all(btn_back, 0, 0);
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_add_event_cb(btn_back, recorder_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label_back = lv_label_create(btn_back);
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0);
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    s_recorder_time_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_recorder_time_label, "00:00");
    lv_obj_set_style_text_font(s_recorder_time_label, &lv_font_montserrat_24, 0);
    lv_obj_set_style_text_color(s_recorder_time_label, lv_color_hex(0x1f2933), 0);
    lv_obj_align(s_recorder_time_label, LV_ALIGN_TOP_MID, 0, 62);

    s_recorder_status_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_recorder_status_label, "Ready");
    lv_obj_set_style_text_font(s_recorder_status_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_recorder_status_label, lv_color_hex(0x3b4856), 0);
    lv_obj_align(s_recorder_status_label, LV_ALIGN_TOP_MID, 0, 98);

