xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    s_recorder_level_bar = lv_bar_create(icon_in_obj);
    lv_obj_set_size(s_recorder_level_bar, 220, 12);
    lv_bar_set_range(s_recorder_level_bar, 0, 100);
    lv_bar_set_value(s_recorder_level_bar, 0, LV_ANIM_OFF);
    lv_obj_align(s_recorder_level_bar, LV_ALIGN_TOP_MID, 0, 128);

    lv_obj_t *btn_record = lv_btn_create(icon_in_obj);
    lv_obj_set_size(btn_record, 118, 46);
    lv_obj_align(btn_record, LV_ALIGN_TOP_MID, 0, 154);
    lv_obj_set_style_bg_color(btn_record, lv_color_hex(0xd64b4b), 0);
    lv_obj_set_style_radius(btn_record, 8, 0);
    lv_obj_add_event_cb(btn_record, recorder_toggle_cb, LV_EVENT_CLICKED, NULL);

    s_recorder_button_label = lv_label_create(btn_record);
    lv_label_set_text(s_recorder_button_label, "开始");
    lv_obj_set_style_text_font(s_recorder_button_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_recorder_button_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(s_recorder_button_label);

    s_recorder_file_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_recorder_file_label, "");
    lv_label_set_long_mode(s_recorder_file_label, LV_LABEL_LONG_SCROLL_CIRCULAR);
    lv_obj_set_width(s_recorder_file_label, 290);
    lv_obj_set_style_text_font(s_recorder_file_label, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(s_recorder_file_label, lv_color_hex(0x627181), 0);
    lv_obj_align(s_recorder_file_label, LV_ALIGN_BOTTOM_MID, 0, -12);

    s_recorder_active = false;
    s_recorder_exit_requested = false;
    icon_flag = RECORDER_ICON_FLAG;
}


/******************************** 媒体库 应用程序 *****************************************************************************/
#define MEDIA_LIBRARY_ICON_FLAG 10
#define MEDIA_INDEX_PATH SD_MOUNT_POINT "/szpi/cache/media_index.tsv"
#define MEDIA_SCAN_MAX_FILES 1200
#define MEDIA_SCAN_MAX_DEPTH 8
#define MEDIA_LIST_MAX_ITEMS 80

typedef enum {
    MEDIA_FILTER_ALL = 0,
    MEDIA_FILTER_IMAGE,
    MEDIA_FILTER_AUDIO,
    MEDIA_FILTER_TEXT,
} media_filter_t;

typedef struct {
    uint32_t files;
    uint32_t dirs;
    uint32_t images;
    uint32_t audio;
    uint32_t videos;
    uint32_t text;
    uint32_t other;
    uint64_t image_bytes;
    uint64_t audio_bytes;
    uint64_t video_bytes;
    uint64_t text_bytes;
    uint64_t other_bytes;
    bool limit_reached;
} media_index_stats_t;

typedef struct {
    FILE *index;
    media_index_stats_t stats;
} media_scan_ctx_t;

typedef struct {
    char path[512];
    sd_file_type_t type;
    uint64_t bytes;
} media_list_item_t;

static lv_obj_t *s_media_status_label;
static lv_obj_t *s_media_info_label;
static lv_obj_t *s_media_list;
static TaskHandle_t s_media_scan_task_handle;
static volatile bool s_media_page_active;
static media_index_stats_t s_media_last_stats;
static media_filter_t s_media_filter = MEDIA_FILTER_ALL;
static media_list_item_t *s_media_items[MEDIA_LIST_MAX_ITEMS];
static size_t s_media_item_count;
static bool s_music_return_to_media;

static const char *media_type_name(sd_file_type_t type)
{
    switch (type) {
    case SD_FILE_AUDIO:
        return "audio";
    case SD_FILE_VIDEO:
        return "video";
    case SD_FILE_IMAGE_JPEG:
    case SD_FILE_IMAGE_PNG:
    case SD_FILE_IMAGE_GIF:
        return "image";
    case SD_FILE_TEXT:
        return "text";
    case SD_FILE_OTHER:
    default:
        return "other";
    }
}

static const char *media_filter_name(media_filter_t filter)
{
    switch (filter) {
    case MEDIA_FILTER_IMAGE:
        return "图片";
    case MEDIA_FILTER_AUDIO:
        return "音频";
    case MEDIA_FILTER_TEXT:
        return "文本";
    case MEDIA_FILTER_ALL:
    default:
        return "全部";
    }
}

static bool media_type_matches_filter(sd_file_type_t type, media_filter_t filter)
{
    switch (filter) {
    case MEDIA_FILTER_IMAGE:
        return type == SD_FILE_IMAGE_JPEG || type == SD_FILE_IMAGE_PNG || type == SD_FILE_IMAGE_GIF;
    case MEDIA_FILTER_AUDIO:
        return type == SD_FILE_AUDIO;
    case MEDIA_FILTER_TEXT:
        return type == SD_FILE_TEXT;
    case MEDIA_FILTER_ALL:
    default:
        return type != SD_FILE_OTHER;
    }
}

static sd_file_type_t media_type_from_index_row(const char *type_text, const char *path)
{
    if (type_text == NULL) {
        return SD_FILE_OTHER;
    }
    if (strcmp(type_text, "audio") == 0) {
        return SD_FILE_AUDIO;
    }
    if (strcmp(type_text, "video") == 0) {
        return SD_FILE_VIDEO;
    }
    if (strcmp(type_text, "text") == 0) {
        return SD_FILE_TEXT;
    }
    if (strcmp(type_text, "image") == 0) {
        return sd_classify_file(path);
    }
    return SD_FILE_OTHER;
}

static const char *media_item_symbol(sd_file_type_t type)
{
    switch (type) {
    case SD_FILE_AUDIO:
        return LV_SYMBOL_AUDIO;
    case SD_FILE_VIDEO:
        return LV_SYMBOL_PLAY;
    case SD_FILE_IMAGE_JPEG:
    case SD_FILE_IMAGE_PNG:
    case SD_FILE_IMAGE_GIF:
        return LV_SYMBOL_IMAGE;
    case SD_FILE_TEXT:
    default:
        return LV_SYMBOL_FILE;
    }
}

static const char *media_basename(const char *path)
{
    const char *slash = path != NULL ? strrchr(path, '/') : NULL;
    return slash != NULL && slash[1] != '\0' ? slash + 1 : path;
}

static void media_forget_list_items(void)
{
    for (size_t i = 0; i < s_media_item_count; i++) {
        free(s_media_items[i]);
        s_media_items[i] = NULL;
    }
    s_media_item_count = 0;
}

static void media_clear_list_locked(void)
{
    if (s_media_list != NULL) {
        lv_obj_clean(s_media_list);
    }
    media_forget_list_items();
}

static void media_stats_add_file(media_index_stats_t *stats, sd_file_type_t type, uint64_t bytes)
{
    stats->files++;
    switch (type) {
    case SD_FILE_AUDIO:
        stats->audio++;
        stats->audio_bytes += bytes;
        break;
    case SD_FILE_VIDEO:
        stats->videos++;
        stats->video_bytes += bytes;
        break;
    case SD_FILE_IMAGE_JPEG:
    case SD_FILE_IMAGE_PNG:
    case SD_FILE_IMAGE_GIF:
        stats->images++;
        stats->image_bytes += bytes;
        break;
    case SD_FILE_TEXT:
        stats->text++;
        stats->text_bytes += bytes;
        break;
    case SD_FILE_OTHER:
    default:
        stats->other++;
        stats->other_bytes += bytes;
        break;
    }
}

static void media_write_escaped(FILE *f, const char *text)
{
    for (const unsigned char *p = (const unsigned char *)text; p != NULL && *p != '\0'; p++) {
        if (*p == '\t' || *p == '\r' || *p == '\n') {
            fputc(' ', f);
        } else {
            fputc(*p, f);
        }
    }
}

static void media_index_write_row(FILE *f, sd_file_type_t type, uint64_t bytes, const char *path)
{
    if (f == NULL) {
        return;
    }
    fputs(media_type_name(type), f);
    fprintf(f, "\t%llu\t", (unsigned long long)bytes);
    media_write_escaped(f, path);
    fputc('\n', f);
}

static void media_scan_dir(media_scan_ctx_t *ctx, const char *path, int depth)
{
    if (ctx->stats.files >= MEDIA_SCAN_MAX_FILES) {
        ctx->stats.limit_reached = true;
        return;
    }
    if (depth > MEDIA_SCAN_MAX_DEPTH) {
        return;
    }

    DIR *dir = opendir(path);
    if (dir == NULL) {
        return;
    }

    ctx->stats.dirs++;
    struct dirent *ent;
    while ((ent = readdir(dir)) != NULL) {
        if (strcmp(ent->d_name, ".") == 0 || strcmp(ent->d_name, "..") == 0) {
            continue;
        }

        char child[512];
        int written = snprintf(child, sizeof(child), "%s/%s", path, ent->d_name);
        if (written <= 0 || written >= (int)sizeof(child)) {
            continue;
        }

        struct stat st;
        if (stat(child, &st) != 0) {
            continue;
        }

        if (S_ISDIR(st.st_mode)) {
            media_scan_dir(ctx, child, depth + 1);
        } else if (S_ISREG(st.st_mode)) {
            if (ctx->stats.files >= MEDIA_SCAN_MAX_FILES) {
                ctx->stats.limit_reached = true;
                break;
            }
            sd_file_type_t type = sd_classify_file(child);
            uint64_t bytes = st.st_size > 0 ? (uint64_t)st.st_size : 0;
            media_stats_add_file(&ctx->stats, type, bytes);
            media_index_write_row(ctx->index, type, bytes, child);
        }

