xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
        if (ctx->stats.limit_reached) {
            break;
        }
    }
    closedir(dir);
}

static void media_build_summary(const media_index_stats_t *stats, char *out, size_t out_len)
{
    char image_size[24];
    char audio_size[24];
    char video_size[24];
    char text_size[24];
    char other_size[24];
    sd_format_bytes_u64(image_size, sizeof(image_size), stats->image_bytes);
    sd_format_bytes_u64(audio_size, sizeof(audio_size), stats->audio_bytes);
    sd_format_bytes_u64(video_size, sizeof(video_size), stats->video_bytes);
    sd_format_bytes_u64(text_size, sizeof(text_size), stats->text_bytes);
    sd_format_bytes_u64(other_size, sizeof(other_size), stats->other_bytes);

    snprintf(out, out_len,
             "文件:%lu 目录:%lu\n"
             "图片:%lu  %s\n"
             "音频:%lu  %s\n"
             "视频:%lu  %s\n"
             "文本:%lu  %s\n"
             "其他:%lu  %s\n"
             "索引: /szpi/cache/media_index.tsv%s",
             (unsigned long)stats->files,
             (unsigned long)stats->dirs,
             (unsigned long)stats->images, image_size,
             (unsigned long)stats->audio, audio_size,
             (unsigned long)stats->videos, video_size,
             (unsigned long)stats->text, text_size,
             (unsigned long)stats->other, other_size,
             stats->limit_reached ? "\n已达到本次扫描上限" : "");
}

static void media_update_ui(const char *status, const media_index_stats_t *stats)
{
    if (!s_media_page_active) {
        return;
    }

    char info[512];
    media_build_summary(stats, info, sizeof(info));

    lvgl_port_lock(0);
    if (s_media_status_label != NULL) {
        lv_label_set_text(s_media_status_label, status);
    }
    if (s_media_info_label != NULL) {
        lv_label_set_text(s_media_info_label, info);
    }
    lvgl_port_unlock();
}

static void media_detach_page_refs(void)
{
    s_media_status_label = NULL;
    s_media_info_label = NULL;
    s_media_list = NULL;
}

static void media_item_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    media_list_item_t *item = (media_list_item_t *)lv_event_get_user_data(e);
    if (item == NULL) {
        return;
    }

    char path[sizeof(item->path)];
    strlcpy(path, item->path, sizeof(path));
    sd_file_type_t type = item->type;
    off_t bytes = (off_t)item->bytes;

    if (type == SD_FILE_AUDIO) {
        s_music_return_to_media = true;
        if (music_open_from_path(path, false)) {
            s_media_page_active = false;
            media_forget_list_items();
            media_detach_page_refs();
            return;
        }
        s_music_return_to_media = false;
        sd_preview_message("音频播放", "播放器初始化失败");
        return;
    }

    struct stat st;
    if (stat(path, &st) == 0 && S_ISREG(st.st_mode)) {
        bytes = st.st_size;
    }
    sd_preview_file(path, type, bytes);
}

static void media_populate_list(media_filter_t filter)
{
    FILE *f = fopen(MEDIA_INDEX_PATH, "r");
    bool have_index = f != NULL;
    media_list_item_t *items[MEDIA_LIST_MAX_ITEMS] = {0};
    size_t count = 0;
    bool truncated = false;

    if (have_index) {
        char line[768];
        if (fgets(line, sizeof(line), f) == NULL) {
            line[0] = '\0';
        }

        while (fgets(line, sizeof(line), f) != NULL) {
            char *type_text = line;
            char *size_text = strchr(type_text, '\t');
            if (size_text == NULL) {
                continue;
            }
            *size_text++ = '\0';
            char *path = strchr(size_text, '\t');
            if (path == NULL) {
                continue;
            }
            *path++ = '\0';
            path[strcspn(path, "\r\n")] = '\0';
            if (path[0] == '\0') {
                continue;
            }

            sd_file_type_t type = media_type_from_index_row(type_text, path);
            if (!media_type_matches_filter(type, filter)) {
                continue;
            }

            if (count >= MEDIA_LIST_MAX_ITEMS) {
                truncated = true;
                break;
            }

            media_list_item_t *item = calloc(1, sizeof(*item));
            if (item == NULL) {
                truncated = true;
                break;
            }
            strlcpy(item->path, path, sizeof(item->path));
            item->type = type;
            item->bytes = strtoull(size_text, NULL, 10);
            items[count++] = item;
        }
        fclose(f);
    }

    lvgl_port_lock(0);
    if (!s_media_page_active || s_media_list == NULL) {
        lvgl_port_unlock();
        for (size_t i = 0; i < count; i++) {
            free(items[i]);
        }
        return;
    }

    media_clear_list_locked();
    if (!have_index) {
        lv_obj_t *btn = lv_list_add_btn(s_media_list, LV_SYMBOL_FILE, "先扫描索引");
        lv_obj_set_style_text_font(btn, &font_alipuhui20, 0);
        if (s_media_status_label != NULL) {
            lv_label_set_text(s_media_status_label, "没有索引文件");
        }
        lvgl_port_unlock();
        return;
    }

    if (count == 0) {
        lv_obj_t *btn = lv_list_add_btn(s_media_list, LV_SYMBOL_FILE, "暂无项目");
        lv_obj_set_style_text_font(btn, &font_alipuhui20, 0);
    }

    for (size_t i = 0; i < count; i++) {
        media_list_item_t *item = items[i];
        const char *name = media_basename(item->path);
        lv_obj_t *btn = lv_list_add_btn(s_media_list, media_item_symbol(item->type), name);
        lv_obj_set_style_text_font(btn, &font_alipuhui20, 0);
        lv_obj_add_event_cb(btn, media_item_cb, LV_EVENT_CLICKED, item);
        s_media_items[s_media_item_count++] = item;
        items[i] = NULL;
    }

    if (s_media_status_label != NULL) {
        lv_label_set_text_fmt(s_media_status_label, "%s: %u%s",
                              media_filter_name(filter),
                              (unsigned)s_media_item_count,
                              truncated ? "+" : "");
    }
    lvgl_port_unlock();

    for (size_t i = 0; i < count; i++) {
        free(items[i]);
    }
}

static void media_scan_task(void *arg)
{
    (void)arg;
    media_scan_ctx_t ctx = {0};
    esp_err_t ret = bsp_sdcard_mount();
    if (ret != ESP_OK) {
        media_update_ui("TF卡不可用", &ctx.stats);
        s_media_scan_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

