xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/cache", 0775);

    ctx.index = fopen(MEDIA_INDEX_PATH, "w");
    if (ctx.index != NULL) {
        fputs("type\tsize\tpath\n", ctx.index);
    }
    media_scan_dir(&ctx, SD_MOUNT_POINT, 0);
    if (ctx.index != NULL) {
        fclose(ctx.index);
    }

    s_media_last_stats = ctx.stats;
    media_update_ui(ctx.stats.limit_reached ? "索引完成(已截断)" : "索引完成", &ctx.stats);
    media_populate_list(s_media_filter);
    s_media_scan_task_handle = NULL;
    vTaskDelete(NULL);
}

static void media_start_scan(void)
{
    if (s_media_scan_task_handle != NULL) {
        if (s_media_status_label != NULL) {
            lv_label_set_text(s_media_status_label, "正在索引...");
        }
        return;
    }

    if (s_media_status_label != NULL) {
        lv_label_set_text(s_media_status_label, "正在索引...");
    }
    BaseType_t ok = xTaskCreatePinnedToCore(media_scan_task, "media_scan", 10 * 1024,
                                            NULL, 4, &s_media_scan_task_handle, 1);
    if (ok != pdPASS) {
        s_media_scan_task_handle = NULL;
        if (s_media_status_label != NULL) {
            lv_label_set_text(s_media_status_label, "任务创建失败");
        }
    }
}

static void media_scan_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) == LV_EVENT_CLICKED) {
        media_start_scan();
    }
}

static void media_filter_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    s_media_filter = (media_filter_t)(intptr_t)lv_event_get_user_data(e);
    media_populate_list(s_media_filter);
}

static void media_back_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    s_media_page_active = false;
    s_music_return_to_media = false;
    media_forget_list_items();
    media_detach_page_refs();
    if (icon_in_obj != NULL) {
        lv_obj_del(icon_in_obj);
        icon_in_obj = NULL;
    }
    icon_flag = 0;
}

static lv_obj_t *media_create_button(lv_obj_t *parent, const char *text, int x, int w,
                                     lv_color_t color, lv_event_cb_t cb, void *user_data)
{
    lv_obj_t *btn = lv_btn_create(parent);
    lv_obj_set_size(btn, w, 34);
    lv_obj_align(btn, LV_ALIGN_BOTTOM_LEFT, x, -8);
    lv_obj_set_style_radius(btn, 6, 0);
    lv_obj_set_style_border_width(btn, 0, 0);
    lv_obj_set_style_shadow_opa(btn, LV_OPA_TRANSP, 0);
    lv_obj_set_style_bg_color(btn, color, 0);
    lv_obj_add_event_cb(btn, cb, LV_EVENT_CLICKED, user_data);

    lv_obj_t *label = lv_label_create(btn);
    lv_label_set_text(label, text);
    lv_obj_set_style_text_font(label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(label, lv_color_hex(0xffffff), 0);
    lv_obj_center(label);
    return btn;
}

static void media_create_page(bool auto_scan)
{
    static lv_style_t style;
    static bool style_ready;
    if (!style_ready) {
        lv_style_init(&style);
        lv_style_set_radius(&style, 0);
        lv_style_set_bg_opa(&style, LV_OPA_COVER);
        lv_style_set_bg_color(&style, lv_color_hex(0x111827));
        lv_style_set_border_width(&style, 0);
        lv_style_set_pad_all(&style, 0);
        lv_style_set_width(&style, 320);
        lv_style_set_height(&style, 240);
        style_ready = true;
    }

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    lv_obj_t *title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(title, 320, 40);
    lv_obj_align(title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_pad_all(title, 0, 0);
    lv_obj_set_style_border_width(title, 0, 0);
    lv_obj_set_style_bg_color(title, lv_color_hex(0x5c6f91), 0);

    lv_obj_t *btn_back = lv_btn_create(title);
    lv_obj_align(btn_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_back, 56, 34);
    lv_obj_set_style_border_width(btn_back, 0, 0);
    lv_obj_set_style_pad_all(btn_back, 0, 0);
    lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, 0);
    lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(btn_back, media_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *label_back = lv_label_create(btn_back);
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0);
    lv_obj_center(label_back);

    lv_obj_t *title_label = lv_label_create(title);
    lv_label_set_text(title_label, "媒体库");
    lv_obj_set_style_text_font(title_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(title_label);

    s_media_status_label = lv_label_create(icon_in_obj);
    lv_label_set_text(s_media_status_label, "Ready");
    lv_obj_set_style_text_font(s_media_status_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_media_status_label, lv_color_hex(0xe8eef9), 0);
    lv_obj_align(s_media_status_label, LV_ALIGN_TOP_LEFT, 12, 44);

    lv_obj_t *panel = lv_obj_create(icon_in_obj);
    lv_obj_set_size(panel, 296, 56);
    lv_obj_align(panel, LV_ALIGN_TOP_LEFT, 12, 66);
    lv_obj_set_style_radius(panel, 6, 0);
    lv_obj_set_style_border_width(panel, 0, 0);
    lv_obj_set_style_bg_color(panel, lv_color_hex(0x1f2937), 0);
    lv_obj_set_style_pad_all(panel, 8, 0);
    lv_obj_set_scrollbar_mode(panel, LV_SCROLLBAR_MODE_AUTO);

    s_media_info_label = lv_label_create(panel);
    lv_obj_set_width(s_media_info_label, 276);
    lv_label_set_long_mode(s_media_info_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_font(s_media_info_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(s_media_info_label, lv_color_hex(0xffffff), 0);
    lv_label_set_text(s_media_info_label, "等待扫描...");

    s_media_list = lv_list_create(icon_in_obj);
    lv_obj_set_size(s_media_list, 296, 68);
    lv_obj_align(s_media_list, LV_ALIGN_TOP_LEFT, 12, 126);
    lv_obj_set_style_border_width(s_media_list, 0, 0);
    lv_obj_set_style_radius(s_media_list, 6, 0);
    lv_obj_set_style_text_font(s_media_list, &font_alipuhui20, 0);
    lv_obj_set_scrollbar_mode(s_media_list, LV_SCROLLBAR_MODE_AUTO);

    media_create_button(icon_in_obj, "全", 8, 56, lv_color_hex(0x3662a3), media_filter_cb, (void *)MEDIA_FILTER_ALL);
    media_create_button(icon_in_obj, "图", 68, 56, lv_color_hex(0x2fa66a), media_filter_cb, (void *)MEDIA_FILTER_IMAGE);
    media_create_button(icon_in_obj, "音", 128, 56, lv_color_hex(0x4c7bd9), media_filter_cb, (void *)MEDIA_FILTER_AUDIO);
    media_create_button(icon_in_obj, "文", 188, 56, lv_color_hex(0xc08a34), media_filter_cb, (void *)MEDIA_FILTER_TEXT);
    media_create_button(icon_in_obj, "扫", 248, 56, lv_color_hex(0x6d5bd0), media_scan_cb, NULL);

    s_media_page_active = true;
    icon_flag = MEDIA_LIBRARY_ICON_FLAG;
    if (s_media_last_stats.files > 0) {
        media_update_ui("上次索引", &s_media_last_stats);
    }
    media_populate_list(s_media_filter);
    if (auto_scan) {
        media_start_scan();
    }
}

static void media_event_handler(lv_event_t *e)
{
    (void)e;
    media_create_page(true);
}

static bool media_restore_from_music(void)
{
    if (!s_music_return_to_media) {
        return false;
    }

