xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    BaseType_t ok = xTaskCreatePinnedToCore(home_button_task, "home_button", 4 * 1024, NULL, 4, NULL, 1);
    if (ok == pdPASS) {
        s_home_button_task_started = true;
    } else {
        ESP_LOGE(TAG, "create home_button task failed");
    }
}

static void home_gesture_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_GESTURE) {
        return;
    }

    lv_indev_t *indev = lv_indev_get_act();
    if (indev == NULL) {
        return;
    }

    lv_dir_t dir = lv_indev_get_gesture_dir(indev);
    if (dir == LV_DIR_LEFT) {
        s_home_swipe_suppress_click = true;
        home_request_page_switch(1);
        home_defer_clear_swipe_suppress();
    } else if (dir == LV_DIR_RIGHT) {
        s_home_swipe_suppress_click = true;
        home_request_page_switch(-1);
        home_defer_clear_swipe_suppress();
    }
}

static void home_pointer_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_indev_t *indev = lv_indev_get_act();
    if (indev == NULL) {
        return;
    }

    if (code == LV_EVENT_PRESSED) {
        if (icon_flag != 0) {
            return;
        }
        lv_indev_get_point(indev, &s_home_press_point);
        s_home_press_tracking = true;
        s_home_swipe_consumed = false;
        return;
    }

    if (code == LV_EVENT_PRESSING) {
        if (!s_home_press_tracking || s_home_swipe_consumed || icon_flag != 0) {
            return;
        }

        lv_point_t point;
        lv_indev_get_point(indev, &point);
        int dx = point.x - s_home_press_point.x;
        int dy = point.y - s_home_press_point.y;
        int abs_dx = abs(dx);
        int abs_dy = abs(dy);
        if (abs_dx >= HOME_SWIPE_THRESHOLD && abs_dx > abs_dy + HOME_SWIPE_AXIS_MARGIN) {
            s_home_swipe_consumed = true;
            s_home_press_tracking = false;
            s_home_swipe_suppress_click = true;
            home_request_page_switch(dx < 0 ? 1 : -1);
            home_defer_clear_swipe_suppress();
        }
        return;
    }

    if (code == LV_EVENT_RELEASED || code == LV_EVENT_PRESS_LOST) {
        s_home_press_tracking = false;
        s_home_swipe_consumed = false;
    }
}

static void home_create_icon(const home_app_item_t *app, uint8_t slot)
{
    static const lv_coord_t x_pos[2] = { 8, 164 };
    static const lv_coord_t y_pos[2] = { 50, 136 };
    uint8_t col = slot % 2;
    uint8_t row = slot / 2;

    lv_obj_t *btn = lv_btn_create(s_home_icon_layer);
    lv_obj_add_style(btn, &s_home_button_style, 0);
    lv_obj_add_style(btn, &s_home_button_pressed_style, LV_STATE_PRESSED);
    lv_obj_set_style_bg_color(btn, lv_color_hex(app->color_hex), 0);
    lv_obj_set_size(btn, 148, 76);
    lv_obj_set_pos(btn, x_pos[col], y_pos[row] - 45);
    lv_obj_clear_flag(btn, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(btn, LV_OBJ_FLAG_GESTURE_BUBBLE);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_PRESSED, NULL);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_PRESSING, NULL);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_RELEASED, NULL);
    lv_obj_add_event_cb(btn, home_pointer_cb, LV_EVENT_PRESS_LOST, NULL);
    lv_obj_add_event_cb(btn, home_app_clicked_cb, LV_EVENT_CLICKED, (void *)app);
    lv_obj_add_event_cb(btn, home_gesture_cb, LV_EVENT_GESTURE, NULL);

    if (app->icon_type == HOME_ICON_IMAGE) {
        lv_obj_t *img = lv_img_create(btn);
        lv_img_set_src(img, app->icon_src);
        lv_img_set_zoom(img, 192);
        lv_obj_align(img, LV_ALIGN_LEFT_MID, 7, 0);
    } else {
        lv_obj_t *symbol = lv_label_create(btn);
        lv_label_set_text(symbol, (const char *)app->icon_src);
        lv_obj_set_style_text_font(symbol, &lv_font_montserrat_24, 0);
        lv_obj_set_style_text_color(symbol, lv_color_hex(0xffffff), 0);
        lv_obj_align(symbol, LV_ALIGN_LEFT_MID, 24, 0);
    }

    lv_obj_t *title = lv_label_create(btn);
    lv_label_set_text(title, app->title);
    lv_obj_set_style_text_font(title, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title, lv_color_hex(0xffffff), 0);
    lv_obj_set_width(title, 68);
    lv_obj_align(title, LV_ALIGN_LEFT_MID, 76, -12);

    lv_obj_t *subtitle = lv_label_create(btn);
    lv_label_set_text(subtitle, app->subtitle);
    lv_obj_set_style_text_font(subtitle, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(subtitle, lv_color_hex(0xf2f5f8), 0);
    lv_obj_set_style_text_opa(subtitle, LV_OPA_80, 0);
    lv_obj_set_width(subtitle, 68);
    lv_obj_align(subtitle, LV_ALIGN_LEFT_MID, 76, 15);
}

static void home_render_page(void)
{
    if (s_home_icon_layer == NULL) {
        return;
    }

    lv_obj_clean(s_home_icon_layer);

    uint8_t first = s_home_page_index * HOME_ITEMS_PER_PAGE;
    uint8_t app_count = sizeof(s_home_apps) / sizeof(s_home_apps[0]);
    for (uint8_t slot = 0; slot < HOME_ITEMS_PER_PAGE; slot++) {
        uint8_t app_index = first + slot;
        if (app_index >= app_count) {
            break;
        }
        home_create_icon(&s_home_apps[app_index], slot);
    }

    if (s_home_page_label != NULL) {
        lv_label_set_text_fmt(s_home_page_label, "%d/%d", s_home_page_index + 1, home_page_count());
    }
}

void lv_main_page(void)
{
    lvgl_port_lock(0);

    home_styles_init();
    lv_obj_set_style_bg_color(lv_scr_act(), lv_color_hex(0x000000), 0);

    main_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(main_obj, &s_home_bg_style, 0);
    lv_obj_clear_flag(main_obj, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(main_obj, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(main_obj, home_pointer_cb, LV_EVENT_PRESSED, NULL);
    lv_obj_add_event_cb(main_obj, home_pointer_cb, LV_EVENT_PRESSING, NULL);
    lv_obj_add_event_cb(main_obj, home_pointer_cb, LV_EVENT_RELEASED, NULL);
    lv_obj_add_event_cb(main_obj, home_pointer_cb, LV_EVENT_PRESS_LOST, NULL);
    lv_obj_add_event_cb(main_obj, home_gesture_cb, LV_EVENT_GESTURE, NULL);

    lv_obj_t *top_line = lv_obj_create(main_obj);
    lv_obj_set_size(top_line, 320, 1);
    lv_obj_set_pos(top_line, 0, 39);
    lv_obj_set_style_pad_all(top_line, 0, 0);
    lv_obj_set_style_border_width(top_line, 0, 0);
    lv_obj_set_style_bg_color(top_line, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_bg_opa(top_line, LV_OPA_20, 0);

    // 显示右上角符号
    lv_obj_t * sylbom_label = lv_label_create(main_obj);
    lv_obj_set_style_text_font(sylbom_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(sylbom_label, lv_color_hex(0xffffff), 0);
    lv_label_set_text(sylbom_label, LV_SYMBOL_BLUETOOTH" "LV_SYMBOL_WIFI);
    lv_obj_align_to(sylbom_label, main_obj, LV_ALIGN_TOP_RIGHT, -10, 10);

    // 显示左上角欢迎语
    main_text_label = lv_label_create(main_obj);
    lv_obj_set_style_text_font(main_text_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(main_text_label, lv_color_hex(0xffffff), 0);
    lv_label_set_long_mode(main_text_label, LV_LABEL_LONG_SCROLL_CIRCULAR);
    lv_obj_set_width(main_text_label, 215);
    lv_label_set_text(main_text_label, "SZPI-S3 掌机");
    lv_obj_align_to(main_text_label, main_obj, LV_ALIGN_TOP_LEFT, 10, 6);

    s_home_icon_layer = lv_obj_create(main_obj);
    lv_obj_set_size(s_home_icon_layer, 320, 176);
    lv_obj_set_pos(s_home_icon_layer, 0, 45);
    lv_obj_set_style_pad_all(s_home_icon_layer, 0, 0);
    lv_obj_set_style_border_width(s_home_icon_layer, 0, 0);
    lv_obj_set_style_radius(s_home_icon_layer, 0, 0);
    lv_obj_set_style_bg_opa(s_home_icon_layer, LV_OPA_TRANSP, 0);
    lv_obj_clear_flag(s_home_icon_layer, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(s_home_icon_layer, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(s_home_icon_layer, home_pointer_cb, LV_EVENT_PRESSED, NULL);
    lv_obj_add_event_cb(s_home_icon_layer, home_pointer_cb, LV_EVENT_PRESSING, NULL);
    lv_obj_add_event_cb(s_home_icon_layer, home_pointer_cb, LV_EVENT_RELEASED, NULL);
    lv_obj_add_event_cb(s_home_icon_layer, home_pointer_cb, LV_EVENT_PRESS_LOST, NULL);
    lv_obj_add_event_cb(s_home_icon_layer, home_gesture_cb, LV_EVENT_GESTURE, NULL);

    s_home_page_label = lv_label_create(main_obj);
    lv_obj_set_style_text_font(s_home_page_label, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(s_home_page_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_text_opa(s_home_page_label, LV_OPA_70, 0);
    lv_obj_align(s_home_page_label, LV_ALIGN_BOTTOM_MID, 0, -7);

    s_home_page_index = 0;
    home_render_page();
    home_ensure_button_task();

    icon_flag = 0;
    lvgl_port_unlock();

    wifi_start_autoconnect();
}

